import * as z from "zod";

export const FORM_SERVICES = [
  "Діагностика зору та консультація лікаря",
  "Лікування катаракти",
  "Лікування глаукоми",
  "Лазерна корекція зору",
  "Лікування захворювання сітківки",
  "Консультація дитячого офтальмолога",
  "Підбір окулярів",
  "Лікування каратоконусу",
  "Інше",
];

export const schema = z.object({
  service: z.string().min(1, "Виберіть послугу"),
  name: z.string().min(2, "Ім'я має мути не менше 2 символів"),
  phone: z
    .string()
    .min(1, "Вкажіть телефон")
    .regex(/^\+?[0-9\s\-\(\)]{7,15}$/, "Не правильний формат телефону"),
});

export type TypeFormData = z.infer<typeof schema>;
