export const ADRESSES = [
  {
    name: "м. Ужгород, вул. Фединця 2",
    link: "https://maps.app.goo.gl/s9D6WupURTs9fW8J8",
    photo: "/img/contacts/fedycya.jpg",
    title: "Наша клініка по вулиці Фединця",
    desc: "За цією адресою ви можете отримати повний спектр офтальмологічних послуг. Починаючі від діагностики і закінчуючи найскладнішими оперативними втручаннями.",
  },
  {
    name: "м. Ужгород, Пл. Петефі 1",
    link: "https://maps.app.goo.gl/sWWhcJunPjHGVLrPA",
    photo: "/img/contacts/fedycya.jpg",
    title: "Наша клініка по вулиці Петефі",
    desc: "За цією адресою ви можете отримати повний спектр офтальмологічних послуг. Починаючі від діагностики і закінчуючи найскладнішими оперативними втручаннями.",
  },
  {
    name: "м. Ужгород, Вул . Занковецької 77г",
    link: "https://maps.app.goo.gl/GQAkMCxFTm6aBwYYA",
    photo: "/img/contacts/fedycya.jpg",
    title: "Наша клініка по вулиці Занковецької",
    desc: "За цією адресою ви можете отримати повний спектр офтальмологічних послуг. Починаючі від діагностики і закінчуючи найскладнішими оперативними втручаннями.",
  },
];
