export const ADRESSES = [
  {
    name: "м. Ужгород, вул. Фединця, 2",
    link: "https://maps.app.goo.gl/s9D6WupURTs9fW8J8",
    photo: "/img/contacts/feduca.jpg",
    title: "Офтальмологічний центр Дмитра Горячева 0 вул. Фединця, 2",
    desc: [
      "У самому серці Ужгорода, на вулиці Фединця, 2, розташований Офтальмологічний центр Дмитра Горячева - простір, де сучасні медичні технології поєднуються з професійною офтальмологічною допомогою. Тут пацієнти можуть пройти комплексну діагностику зору, отримати консультацію лікаря-офтальмолога та визначити подальшу тактику лікування відповідно до індивідуальних потреб.",
      "Ми приділяємо увагу кожному етапу візиту - від першого звернення до зрозумілого пояснення результатів обстеження та рекомендацій лікаря.",
    ],
  },
  {
    name: "м. Ужгород, пл. Шандора Петефі, 1",
    link: "https://maps.app.goo.gl/sWWhcJunPjHGVLrPA",
    photo: "/img/contacts/petefi.jpg",
    title: "Офтальмологічний центр Дмитра Горячева - пл. Шандора Петефі, 1",
    desc: [
      "Завітайте до нашої локації на площі Шандора Петефі, 1, в історичній частині Ужгорода.",
      `Ми створили комфортний простір, де ви можете приділити увагу здоров'ю очей, а також ознайомитися з асортиментом оптичних і сонцезахисних окулярів у Goriachev Glasses. Наші консультанти допоможуть підібрати оправу відповідно до ваших побажань, форми обличчя та індивідуального стилю. Ви зможете приміряти різні моделі, порівняти їхню посадку й обрати окуляри для повсякденного комфорту.`,
    ],
  },
  {
    name: "м. Ужгород, вул. Заньковецької, 77Г",
    link: "https://maps.app.goo.gl/GQAkMCxFTm6aBwYYA",
    photo: "/img/contacts/zankovecka.jpg",
    title: "Офтальмологічний центр Дмитра Горячева - вул. Заньковецької, 77Г",
    desc: [
      "На вулиці Заньковецької, 77Г, в Ужгороді ми раді вітати вас у ще одній локації Офтальмологічного центру Дмитра Горячева. Тут ми приділяємо особливу увагу поєднанню медичної експертності, уважного ставлення до відвідувачів і комфортного обслуговування. Тут також ви можете познайомитися з колекціями оптичних і сонцезахисних окулярів, приміряти оправи різних стилів та отримати допомогу у виборі відповідної моделі. Наша мета - щоб кожен відвідувач міг знайти рішення, яке відповідатиме його потребам, способу життя та особистим вподобанням.",
    ],
  },
];
