import { FC } from "react";

import InfoBlock from "@/components/shared/InfoBlock";

const Responsibilities: FC = () => (
  <InfoBlock
    img={{
      url: "/img/home/handshake.jpeg",
      alt: "Handshake",
    }}
  >
    <h2 className="not-prose">Дотримуємось соціальної відповідальності</h2>
    <p>
      Наш центр працює офіційно та сплачує податки в державний бюджет у повному
      обсязі, підтримуючи країну у непрості часи. Ми з повагою ставимося до
      кожного співробітника, створюючи умови для професійного навчання, набуття
      нової спеціалізації та отримання практичного досвіду.
    </p>
    <p>
      Наша команда поважає пацієнтів і суспільство, в якому ми живемо та
      працюємо. Ми беремо участь у благодійних проєктах — у тому числі
      пов’язаних з підтримкою освіти, спорту та культури.
    </p>
  </InfoBlock>
);

export default Responsibilities;
