import { FC } from "react";

import InfoBlock from "@/components/shared/InfoBlock";

const Responsibilities: FC = () => (
  <InfoBlock
    img={{
      url: "/img/home/handshake.jpg",
      alt: "Handshake",
    }}
  >
    <h2 className="not-prose">
      Соціальна відповідальність - частина наших цінностей
    </h2>
    <p>
      В Офтальмологічному центрі Дмитра Горячева в Ужгороді ми переконані, що
      відповідальність медичного закладу виходить за межі надання якісної
      медичної допомоги. Для нас це також чесність, прозорість діяльності,
      повага до пацієнтів, підтримка команди та активна участь у житті
      суспільства.
    </p>
    <p>
      Ми здійснюємо діяльність відповідно до чинного законодавства України та
      підтримуємо економіку країни. Водночас інвестуємо у професійний розвиток
      наших фахівців, створюємо умови для постійного навчання, підвищення
      кваліфікації та впровадження сучасних підходів до офтальмологічної
      допомоги.
    </p>
    <p>
      Важливою частиною нашої роботи є участь у благодійних і соціальних
      ініціативах, спрямованих на підтримку людей та розвиток громади. Ми
      підтримуємо проєкти у сферах освіти, спорту й культури, адже віримо, що
      розвиток суспільства починається з небайдужості та конкретних дій.
    </p>
    <p>
      Для нас соціальна відповідальність - це не формальність, а принцип, яким
      ми керуємося щодня у своїй роботі.
    </p>
  </InfoBlock>
);

export default Responsibilities;
