import { PageBlock, TypePageBlocks } from "../shared/PageBlocks/interfaces";

export default [
  {
    type: PageBlock.info,
    img: {
      url: "/img/services/dityacha-oftalmologiya/child-ophtalmologist.jpeg",
      alt: "Дитячий офтальмолог",
    },
    body: (
      <>
        <h2 className="not-prose">
          Дитячий офтальмолог у Львові в нашому центрі — ваш надійний лікар
        </h2>
        <p>
          Спеціалісти клініки Дмитра Горячева використовують сучасні методи
          діагностики. Ми виявляємо очні захворювання та вроджені патології на
          ранніх стадіях, коли вони ще не встигли серйозно вплинути на стан
          зорової системи дитини. Індивідуальний підхід дозволяє нам підбирати
          найефективніші та найбезпечніші схеми лікування, які допомагають
          зберегти зір у дітей і мінімізувати ймовірність ускладнень.
        </p>
        <p>
          Вибравши наш медичний центр, ви можете записатися на консультацію як
          для лікування, так і для профілактичного огляду. Регулярна діагностика
          зору у дітей — дуже важлива процедура, яка допомагає виявити
          захворювання очей на ранніх стадіях.
        </p>
      </>
    ),
  },
  {
    type: PageBlock.info,
    reverse: true,
    img: {
      url: "/img/services/dityacha-oftalmologiya/newborn-check.jpeg",
      alt: "Огляд малюків",
    },
    body: (
      <>
        <h2 className="not-prose">Огляд малюків</h2>
        <p>
          Новонароджені малюки планово оглядаються в 1 місяць, за потреби — у
          перший день від народження.&nbsp; Обстеження дозволяє виявити
          внутрішні патології, щоб вчасно прийняти рішення про початок
          медикаментозного чи хірургічного лікування.
        </p>
        <p>
          Особливої уваги потребують малюки, що народилися передчасно. У них
          може розвиватися ретинопатія недоношених — пошкодження сітківки. Така
          патологія потребує негайного втручання, оскільки призводить до
          безповоротної втрати зору.
        </p>
        <p>Найчастішою причиною звернення є дакріоцистит.</p>
        <p>
          Це запалення слізного мішка, що супроводжується гнійними виділеннями.
          Воно потребує негайного лікування — консервативного у формі крапель,
          масажу та промивання або хірургічного — зондування.
        </p>
      </>
    ),
  },
  {
    type: PageBlock.info,
    img: {
      url: "/img/services/dityacha-oftalmologiya/preschool.jpeg",
      alt: "Огляд дитини від 1 року",
    },
    body: (
      <>
        <h2 className="not-prose">
          Огляд дитини від 1 року і до шкільного віку
        </h2>
        <p>
          У цьому віці зберігається високий ризик розвитку амбліопії — так
          званого «лінивого ока». Тому лікар-офтальмолог приділяє особливу увагу
          наступним методам діагностики:
        </p>
        <ul>
          <li>перевірці явного та прихованого кута косоокості</li>
          <li>
            огляду очного дна з розширенням зіниці за допомогою спеціальних
            крапель
          </li>
          <li>перевірці рефракції ока</li>
          <li>оцінці гостроти зору</li>
        </ul>
        <p>
          Батькам дітей дошкільного віку бажано записуватися на прийом до
          дитячого окуліста у Львові щонайменше один раз на рік, а за наявних
          патологій зору в дитини — частіше.
        </p>
      </>
    ),
  },
  {
    type: PageBlock.info,
    reverse: true,
    img: {
      url: "/img/services/dityacha-oftalmologiya/school-kids.jpeg",
      alt: "Огляд дітей від шкільного віку",
    },
    body: (
      <>
        <h2 className="not-prose">
          Огляд дітей від шкільного віку до 18 років
        </h2>
        <p>
          Патології органів зору можуть проявлятися і пізніше — особливо
          внаслідок травм, надмірного навантаження чи супутніх захворювань та
          спадковості. Тому у дітей шкільного віку та підлітків огляд
          проводиться один раз на рік — зазвичай для цього вибирають період
          літніх канікул. Лікар проводить наступні дослідження:
        </p>
        <ul>
          <li>визначення рефракції</li>
          <li>огляд переднього відрізку ока - біомікроскопія</li>
          <li>оцінку стану очного дна</li>
          <li>
            перевірку акомодації — здатності фокусуватись на різних відстанях
          </li>
          <li>виявлення косоокості, оцінку кута відхилення ока</li>
        </ul>
      </>
    ),
  },
  {
    type: PageBlock.articles,
    title: "Лікування зору у дітей в центрі Дмитра Горячева",
    articles: [
      {
        img: "/img/services/dityacha-oftalmologiya/device-treatment.jpeg",
        name: "Апаратне лікування",
        desc: (
          <>
            <p>
              Апаратне лікування (зорову терапію) проводимо на сучасному
              обладнанні, а деяке - унікальне в Україні!
              <br />
              Дитина грає, а зір покращується!
              <br />
              Метод лікування полягає у тренуванні зорового апарату дитини.
              Відбувається у ігровій формі, тому навіть наймолодші пацієнти з
              радістю відвідують такі процедури.
            </p>
            <p>Проводиться з метою:</p>
            <ul>
              <li>Підвищення гостроти зору</li>
              <li>Розвитку бінокулярного зору</li>
              <li>Стимуляції роботи зорового аналізатору</li>
              <li>Покращення тонусу очних м’язів</li>
            </ul>
            <p>
              Комплекс апаратів обирає дитячий офтальмолог залежно від діагнозу
              та мети лікування.
            </p>
          </>
        ),
      },
      {
        img: "/img/services/dityacha-oftalmologiya/night-lenses.jpeg",
        name: "Корекція зору нічними лінзами",
        desc: (
          <>
            <p>
              Ортокератологія - корекція зору жорстими контактними лінзами, які
              мʼяко змінюють передню поверхню рогівки. Дитина спить в лінзах, а
              зранку знімає їх та чітко бачить протягом усього дня. Найчастіше
              такий вид корекції застосовується при короткозорості та
              астигматизмі.
            </p>
            <p>
              Ми використовуємо нічні лінзи компанії Paragon - лідера на ринку
              ортокератології.
            </p>
            <p>
              Нічні лінзи також слугують ефективним способом стабілізації
              короткозорості та сповільнюють її прогресування.
            </p>
          </>
        ),
      },
      {
        img: "/img/services/dityacha-oftalmologiya/strabismus-correction.jpeg",
        name: "Корекція косоокості",
        desc: (
          <ul>
            <li>
              консервативне лікування — окуляри рефракційні, окуляри призматичні
            </li>
            <li>апаратне ортоптичне лікування</li>
            <li>хірургічне лікування з допомогою введення ботулотоксину</li>
            <li>хірургічним шляхом зміна місця прикріплення мʼязів</li>
          </ul>
        ),
      },
      {
        img: "/img/services/dityacha-oftalmologiya/consult.jpeg",
        name: "Консультація дитячого офтальмолога та діагностика зору",
        desc: (
          <>
            <p>
              Профілактичний огляд для пацієнтів будь-якого віку — від моменту
              народження до 18 років. Проведення апаратних досліджень за
              допомогою сучасного обладнання, підбір окулярів і контактних лінз.
            </p>
            <p>
              За необхідності наші спеціалісти проводять розширену діагностику —
              компʼютерну томографію сітківки, кератотопографію, визначення поля
              зору, ультразвукове обстеження.
            </p>
          </>
        ),
      },
      {
        img: "/img/services/dityacha-oftalmologiya/dakriocist.jpeg",
        name: "Лікування дакріоциститу",
        desc: (
          <>
            <p>
              Дакріоцистит — це запалення слізного мішка через погану
              прохідність сльози з конʼюктивального мішка в носові пазухи. Наша
              клініка використовує наступні методи лікування:
            </p>
            <ul>
              <li>
                консервативний — застосування крапель і масаж носослізного
                каналу
              </li>
              <li>хірургічне — зондування та промивання носослізного каналу</li>
            </ul>
          </>
        ),
      },
      {
        img: "/img/services/dityacha-oftalmologiya/premature-baby.jpeg",
        name: "Лікування ретинопатії недоношених",
        desc: (
          <>
            <p>
              Ретинопатія недоношених — патологія розвитку сітківки, пов’язана з
              неправильним ростом судин в незрілій сітківці. Виникає в дітей, що
              народились передчасно. Досвідчені лікарі нашої клініки
              використовують наступні методи лікування:
            </p>
            <ul>
              <li>
                лазерокоагуляцію аваскулярних зон сітківки — «склеювання» за
                допомогою безпечного лазерного променя
              </li>
              <li>
                анти-ФРЕС терапію — ін’єкцію препаратів, що зупиняють
                прогресування хвороби
              </li>
            </ul>
          </>
        ),
      },
      {
        img: "/img/services/dityacha-oftalmologiya/refraction.jpeg",
        name: "Лікування порушень рефракції",
        desc: (
          <>
            <p>
              У Офтальмологічному центрі Дмитра Горячева для лікування порушень
              рефракції застосовуємо:
            </p>
            <ul>
              <li>
                корекція окулярами (сферичні, призматичні, циліндричні,
                мультифокальні, прогресивні)
              </li>
              <li>
                корекція контактними лінзами (сферичні, склеральні,
                астигматичні, кастомізовані, для контролю міопії, нічні
                ортокератологічні Paragon CRT)
              </li>
            </ul>
          </>
        ),
      },
      {
        img: "/img/services/dityacha-oftalmologiya/inflamation.jpeg",
        name: "Лікування запальних захворювань органу зору",
        desc: (
          <>
            <p>
              Ви можете звернутися до дитячого офтальмолога у Львові для
              лікування запальних захворювань органів зору (конʼюктивіт,
              склерит, увеїт, кератит):
            </p>
            <ul>
              <li>
                Медикаментозне лікування. Підбір найкращих схем протизапальної
                та антибактеріальної терапій
              </li>
            </ul>
          </>
        ),
      },
    ],
  },
] as TypePageBlocks[];
