import {
  PageBlock,
  SurgeryStep,
  TypePageBlocks,
  InstructionIcon,
} from "../shared/PageBlocks/interfaces";

export default [
  {
    type: PageBlock.accordion,
    accordion: [
      {
        name: "Факічні інтраокулярні лінзи (ІОЛ)",
        desc: (
          <>
            <p>
              Це ультратонкі лінзи, що імплантовуються всередину ока поверх
              Вашого природнього кришталика. Робиться це через астигматично
              нейтральний маленький розтин, що сам адаптовується (загоюється).
            </p>
            <p>
              У нашому центрі імплантовуються задньокамерні факічні
              інтраокулярні лінзи — Visian ICL (Staar Surgical; USA).
            </p>
            <p>
              Унікальність полягає в безпечній корекції високих ступенів
              короткозорості, астигматизму з відновленням максимальної якості
              зору при неможливості виконання лазерної корекції.
            </p>
          </>
        ),
      },
    ],
    carousel: [SurgeryStep["iol"]],
  },
  {
    type: PageBlock.info,
    reverse: true,
    img: {
      url: "/img/services/implantatsiya-fakichnikh-linz/iol-pokazy.jpeg",
      alt: "Покази до імплантації факічних лінз",
    },
    body: (
      <>
        <h2 className="not-prose">Покази до імплантації факічних лінз</h2>
        <ul>
          <li>короткозорість, астигматизм, далекозорість</li>
          <li>
            високі ступені короткозорості, астигматизму,&nbsp;що не підлягають
            безпечній лазерній корекції
          </li>
          <li>надто тонка рогівка для проведення лазерної корекції зору</li>
          <li>
            ризик кератектазії (прогресуюче стоншення рогівки після лазерної
            корекції)
          </li>
          <li>вік більше 21 року</li>
          <li>кількість ендотеліальних клітин &gt; 2300 клітин/мм&nbsp;</li>
          <li>
            кут передньої камери / іридокорнеальний кут (кут куди відтікає
            внутрішньоочна рідина)&nbsp; &gt;30 градусів
          </li>
          <li>мезопічний діаметр зіниці не &gt; 6 мм</li>
        </ul>
      </>
    ),
  },
  {
    type: PageBlock.info,
    img: {
      url: "/img/services/implantatsiya-fakichnikh-linz/iol-cons.jpeg",
      alt: "Протипокази до імплантації факічних лінз",
    },
    body: (
      <>
        <h2 className="not-prose">Протипокази до імплантації факічних лінз</h2>
        <ul>
          <li>запальні захворювання очей (увеїти, кератити)</li>
          <li>катаракта</li>
          <li>захворювання сітківки</li>
          <li>глаукома</li>
          <li>аутоімунні захворювання</li>
          <li>цукровий діабет</li>
        </ul>
      </>
    ),
  },
  {
    type: PageBlock.info,
    reverse: true,
    img: {
      url: "/img/services/implantatsiya-fakichnikh-linz/iol-choose.jpeg",
      alt: "Підбір факічних інтраокулярних лінз",
    },
    body: (
      <>
        <h2 className="not-prose">Підбір факічних інтраокулярних лінз</h2>
        <p>
          Компанія виробник Visian ICL Staar Surgical має програмне
          забезпечення, що дозволяє максимально точно підібрати силу та розмір
          лінзи. Ці лінзи для кожного пацієнта та ока пацієнта&nbsp;є
          костюмізовані (тобто індивідуально підібрані) — враховуючи будову ока
          та рефракцію (силу короткозорості, астигматизму чи далекозорості)
          пацієнта.
        </p>
        <p>Передопераційне обстеження включає:</p>
        <ul>
          <li>фотографування переднього відрізка ока&nbsp;та очного дна</li>
          <li>оптичну когерентну томографію переднього відрізку</li>
          <li>ендотеліальну мікроскопію</li>
          <li>рефрактометрію</li>
          <li>перевірку гостроти зору та корекцію зору</li>
          <li>визначення діаметру зіниці в умовах різного освітлення</li>
          <li>ультразвукову біомікроскопію (UBM)</li>
          <li>біомікроскопію</li>
          <li>гоніоскопію</li>
          <li>огляд очного дна</li>
        </ul>
      </>
    ),
  },
  {
    type: PageBlock.accordion,
    carouselName: "Етапи операції",
    accordion: [
      {
        name: "Хірургічна техніка",
        desc: (
          <p>
            Задньокамерна факічна лінза Visian ICL імплантовується спочатку у
            спеціальний картридж, через який вона вводитеметься у око. У
            передній поверхні ока робиться розтин довжиною 3.2 мм, в око
            вводиться гелеподібна захисна речовина, що дозволяє безпечно ввести
            лінзу в передню камеру, а потім розістити її за райдужкою
            (оболонкою, що надає колір очам) поверх нашого природнього
            кришталика. Наступним етапом гелеподібна речовина вимивається,
            розтин адаптовується та закапуються антибактеральні краплі.
          </p>
        ),
      },
    ],
    carousel: [
      SurgeryStep["open-eye-fiksacia"],
      SurgeryStep["anastezia-local"],
      SurgeryStep["cut3-1"],
      SurgeryStep["placing-iol"],
      SurgeryStep["adaptation"],
    ],
  },
  {
    type: PageBlock.info,
    reverse: true,
    img: {
      url: "/img/services/implantatsiya-fakichnikh-linz/iol-clinic.png",
      alt: "Клінічні результати",
    },
    body: (
      <>
        <h2 className="not-prose">
          Клінічні результати факічних інтраокулярних лінз
        </h2>
        <p>
          Факічні ІОЛ забезпечують високу якість зображення, вищий рівень
          сатисфакції (задоволення пацієнтів) та не мають ризику
          післяопераційної кератектазії (стоншення рогівки) при лікуванні
          високих ступеней короткозорості, астигматизму у очах, схильних до
          цього.
        </p>
        <p>
          Дослідження, що порівнювало Факчні ІОЛ з ЛК методом SMILE при
          короткозорості ступенем (-6.0 до -10.0 діоптрій) показало, що
          імплантація факічних ІОЛ давала кращу післяопераційну
          рефракцію,&nbsp;гостроту зору, менше аберацій високих порядків
          (світлових феноменів), кращу суб'єктивну якість зору у порівнянні з
          групою пацієнтів після ЛК методом SMILE.
        </p>
        <p>
          Найчастішою скаргою при імплантації факічних ІОЛ був гало
          ефект&nbsp;(додаткові кола навколо джерела освітлення у вечірній час).
          Впродовж 2-3 місяців у більшості пацієнтів розивалася нейроадаптація
          (зникнення симптому).
        </p>
      </>
    ),
  },
  {
    type: PageBlock.info,
    img: {
      url: "/img/services/implantatsiya-fakichnikh-linz/iol-remove.jpeg",
      alt: "Видалення за потреби факічних лінз",
    },
    body: (
      <>
        <h2 className="not-prose">
          Чи можуть бути видалені за потреби факічні інтраокулярні лінзи?
        </h2>
        <p>
          Факічні ІОЛ призначені для постійної корекції, проте за потреби в
          майбутньому їх можна експлантувати (тобто видалити) через той самий
          розтин, що імплантовувалися у око, наприклад при розвитку катаракти у
          старшому віці. Це їхня перевага у порівнянні з лазерною корекцією, де
          зміни постійні і не зворотні.
        </p>
      </>
    ),
  },
  {
    type: PageBlock.info,
    reverse: true,
    img: {
      url: "/img/services/implantatsiya-fakichnikh-linz/iol-dif.png",
      alt: "Відмінність між факічними лінзами та лінзами",
    },
    body: (
      <>
        <h2 className="not-prose">
          Відмінність між факічними лінзами та лінзами, що імплантовуються при
          заміні кришталика
        </h2>
        <p>
          У оці є свій природній кришталик, що допомагає фокусувати зображення
          на сітківку, коли він перестає виконувати свою функцію з віком
          пацієнтам рекомендують його замінити на штучний, щоб знову повернути
          чіткий зір на різних дистанціях.
        </p>
        <p>
          При цьому Ваш прриродній кришталик видаляється спеціальним
          ультразвуковим апаратом і в мішечок в якому був ваш природній
          кришталик імплантовується гнучка Інтраокулярна Лінза.
        </p>
        <p>
          Факічні Інтраокуярні лінзи — ставляться (імплантовуються) поверх
          природнього кришталика, як додаткова лінза.
        </p>
        <p>
          Рефракційну заміну кришталика у більшості випадків рекомендовано
          проводити після 45-48 років.
        </p>
      </>
    ),
  },
  {
    type: PageBlock.instruction,
    title: "Передопераційні рекомендації при імплантації факічних лінз",
    options: [
      {
        text: "Пройти спеціалізовану діагностику.",
        icon: InstructionIcon["diagnostic"],
      },
      {
        text: "За 7 днів до операції відмовитись від використання контактних лінз.",
        icon: InstructionIcon["no-contacts"],
      },
      {
        text: "Не вживати алкоголь чи седативні препарати, які можуть викликати сонливість.",
        icon: InstructionIcon["no-pills-drink"],
      },
      {
        text: "Взяти з собою сонцезахисні окуляри.",
        icon: InstructionIcon["sunglasses"],
      },
      {
        text: "У день проведення процедури прийняти душ, не користуватись парфумами.",
        icon: InstructionIcon["no-perfume"],
      },
      {
        text: "Відмовитись від куріння в день проведення процедури.",
        icon: InstructionIcon["no-smoking"],
      },
      {
        text: "Прийняти всі ліки при супутніх захворюваннях.",
        icon: InstructionIcon["pills"],
      },
      {
        text: "Закрапати усі краплі, які ви звичайно закрапуєте.",
        icon: InstructionIcon["eye-drops"],
      },
      {
        text: "Протягом двох днів перед процедурою утриматись від застосування косметики.",
        icon: InstructionIcon["no-makeup"],
      },
      {
        text: "Прийти з супроводжуючою особою.",
        icon: InstructionIcon["help"],
      },
    ],
  },
  {
    type: PageBlock.instruction,
    title: "Післяопераційні рекомендації при імплантації факічних лінз",
    options: [
      {
        text: "Протягом 10 днів не можна торкатися ока.",
        icon: InstructionIcon["no-touch"],
      },
      {
        text: "Протягом 14 днів очі можна протирати стерильними серветками.",
        icon: InstructionIcon["wipes"],
      },
      {
        text: "Дотримуйтесь схеми застосування післяопераційних крапель та медикаментів.",
        icon: InstructionIcon["eye-drops"],
      },
      {
        text: "Протягом 14 днів після операції уникати потрапляння в очі води та миючих засобів.",
        icon: InstructionIcon["no-wash"],
      },
      {
        text: "Протягом місяця після операції можлива світло чутливість - одягайте сонцезахисні окуляри.",
        icon: InstructionIcon["sunglasses"],
      },
      {
        text: "Протягом одного місяця утриматись від відвідування басейну, лазні.",
        icon: InstructionIcon["no-swim"],
      },
      {
        text: "Утримайтесь від використання макіяжу, косметики протягом 14 днів.",
        icon: InstructionIcon["no-makeup"],
      },
      {
        text: "Після процедури можна дивитись телевізор, ходити в кіно, театр, музей.",
        icon: InstructionIcon["tv"],
      },
      {
        text: "Алкогольні напої заборонено вживати впродовж місяця.",
        icon: InstructionIcon["no-alco"],
      },
      {
        text: "Не сідайте за кермо поки зір повністю не відновиться.",
        icon: InstructionIcon["no-drive"],
      },
      {
        text: "Їжа може бути звичайною.",
        icon: InstructionIcon["food"],
      },
      {
        text: "Уникайте підйому важких речей та активного спорту протягом місяця після процедури.",
        icon: InstructionIcon["no-sports"],
      },
    ],
  },
] as TypePageBlocks[];
