import { ThumbsDown, ThumbsUp } from "lucide-react";

import {
  PageBlock,
  SurgeryStep,
  TypePageBlocks,
  InstructionIcon,
} from "../shared/PageBlocks/interfaces";

export default [
  {
    type: PageBlock.accordion,
    accordion: [
      {
        name: "Що таке глаукома?",
        desc: (
          <>
            <p>
              Глаукома — це хронічне нейродегенеративне захворювання ока, що
              проявляється відмиранням зорового нерву, змінами у полі зору та
              зазвичай супроводжується підвищеним внутрішньоочним тиском (ВОТ).
            </p>
            <p>
              Глаукома стоїть на другому місці за кількістю випадків сліпоти у
              світі, поступаючись лише катаракті. Метою лікування є уповільнення
              прогресування шляхом зниження ВОТ. Зниження ВОТ на 30% сповільнює
              прогресування утричі.
            </p>
          </>
        ),
      },
    ],
    carousel: [SurgeryStep["konus-retina"], SurgeryStep["ok-sight"]],
  },
  {
    type: PageBlock.info,
    blurCompare: [
      {
        img: {
          url: "/img/services/khirurgiya-glaukomi/glaucoma-free.jpeg",
          alt: "Здоровий вигляд",
        },
        label: "здоровий",
        icon: <ThumbsUp />,
      },
      {
        img: {
          url: "/img/services/khirurgiya-glaukomi/glaucoma-sick.jpeg",
          alt: "Хворий вигляд",
        },
        label: "хворий",
        icon: <ThumbsDown />,
      },
    ],
    body: (
      <>
        <h2 className="not-prose">Відкритокутова глаукома та її симптоми</h2>
        <p>
          Відкритокутова глаукома — іншою назвою є «лагідний вбивця зору», одне
          з найпідступніших захворювань. На початковій і навіть на розвиненій
          стадії пацієнт може не мати жодних скарг, оскільки відмирання зорового
          нерву навіть на третину є непомітним через компенсаторні можливості
          мозку. Зазвичай виявляється випадково під час щорічних
          офтальмологічних обстежень.
        </p>
        <p>
          Особливо уважними мають бути люди, в яких батько чи мати хворіли на
          глаукому — захворювання передається генетично. Тож основне — це
          скринінг, щорічне обстеження в спеціалізованому закладі. Лікування
          відкритокутової глаукоми варто розпочинати якомога раніше — це
          збільшує ймовірність зупинки дегенеративних процесів.
        </p>
        <p>Симптоми на пізній стадії:&nbsp;</p>
        <ul>
          <li>Звуження поля зору, сліпі «місця» у полі зору</li>
          <li>Затуманення</li>
        </ul>
      </>
    ),
  },
  {
    type: PageBlock.info,
    reverse: true,
    img: {
      url: "/img/services/khirurgiya-glaukomi/close-angle-glaucoma.jpeg",
      alt: "Закритокутова глаукома та її симптоми",
    },
    body: (
      <>
        <h2 className="not-prose">Закритокутова глаукома та її симптоми</h2>
        <p>
          Закритокутова глаукома — у більшості випадків розвивається&nbsp; через
          збільшення розміру кришталика з віком (це єдина структура ока, що
          росте з віком), переважно у людей з далекозорістю та&nbsp; малим
          розміром очного яблука.
        </p>
        <p>Симптоми на пізній стадії:&nbsp;</p>
        <ul>
          <li>Періодичне затуманення зору, переважно у нічний час</li>
          <li>
            Біль у оці та навколо, поява райдужних кіл навколо джерела
            освітлення
          </li>
          <li>Можлива нудота</li>
        </ul>
      </>
    ),
  },
  {
    type: PageBlock.info,
    img: {
      url: "/img/services/khirurgiya-glaukomi/glaucoma-tests.jpeg",
      alt: "Діагностика глаукоми",
    },
    body: (
      <>
        <h2 className="not-prose">
          Обстеження, необхідні для діагностики глаукоми
        </h2>
        <p>
          При підозрі на глаукому лікар перевіряє поле зору, гостроту зору, стан
          оптичного нерва та внутрішньоочний тиск. В офтальмологічному центрі
          використовують наступні методи діагностики:
        </p>
        <ul>
          <li>
            оптично-когерентну томографію (ОКТ) — дозволяє виміряти кут
            передньої камери ока та стан диска зорового нерва. Закритий або
            вузький кут буде показанням для термінового лікування закритокутової
            глаукоми
          </li>
          <li>
            Компʼютерну периметрію — ця процедура дозволяє виявити звуження поля
            зору
          </li>
          <li>Вимірювання внутрішньоочного тиску</li>
        </ul>
      </>
    ),
  },
  {
    type: PageBlock.info,
    reverse: true,
    img: {
      url: "/img/services/khirurgiya-glaukomi/glaucoma-risks.jpeg",
      alt: "Ризики розвитку глаукоми",
    },
    body: (
      <>
        <h2 className="not-prose">Фактори ризику розвитку глаукоми</h2>
        <p>Факторами ризику цього захворювання є:</p>
        <ul>
          <li>Підвищений очний тиск</li>
          <li>Наявність випадків глаукоми в родині</li>
          <li>Тонка рогівка</li>
          <li>Короткозорість</li>
          <li>Вік</li>
        </ul>
      </>
    ),
  },
  {
    type: PageBlock.accordion,
    title: "Методи лікування глаукоми, які застосовують наші лікарі",
    stepsOut: true,
    accordion: [
      // {
      //   name: "Високочастотна діатермо-ендосклеротомія (Oertli Швейцарія)",
      //   desc: (
      //     <>
      //       <p>
      //         Високочастотна діатермо-ендосклеротомія (HFDS) — малоінвазивна,
      //         безпечна та ефективна хірургічна процедура для зниження
      //         внутрішньоочного тиску (ВОТ) при відкритокутовій глаукомі (ПВКГ).
      //       </p>
      //       <p>
      //         За допомогою спеціального наконечника хірургічного комбайна OS4,
      //         Oertli, Швейцарія формуються 6 мікроканалів у куті передньої
      //         камери, що покращує відтік внутрішньоочної рідини та знижує ВОТ.
      //         Відмінні довгострокові результати, зниження ВОТ на 40% протягом 5
      //         років у 80 % пацієнтів.
      //       </p>
      //       <ul>
      //         <li>Ідеально поєднується з хірургією катаракти.</li>
      //         <li>Дуже малий ризик ускладнень.</li>
      //         <li>Відсутність швів.</li>
      //         <li>Скорочення часу післяопераційної реабілітації.</li>
      //         <li>Можливість повторення процедури, за необхідності.</li>
      //       </ul>
      //     </>
      //   ),
      //   steps: [
      //     SurgeryStep.anastezia,
      //     SurgeryStep["open-eye"],
      //     SurgeryStep["2cut"],
      //     SurgeryStep.zond,
      //     SurgeryStep["antibiotics-cure"],
      //   ],
      // },
      // {
      //   name: "Селективна лазерна трабекулопластика (Easyret та Оptimis Fusion)",
      //   desc: (
      //     <>
      //       <p>
      //         Лікування відкритокутової глаукоми надсучасними лазерами Easyret
      //         (Quantel Medical) та Оptimis Fusion. Принцип процедури полягає у
      //         очищенні кута лазером від пігменту, що перешкоджає відтоку
      //         внутрішньоочної рідини.
      //       </p>
      //       <ul>
      //         <li>Безболісно.</li>
      //         <li>Швидко, амбулаторно.</li>
      //         <li>
      //           Можливість повторення (не викликає термічного ушкодження
      //           трабекул).
      //         </li>
      //         <li>
      //           Знижує ВОТ від 30-40 відсотків при правильному відборі пацієнтів
      //           протягом 1-2 років.
      //         </li>
      //       </ul>
      //     </>
      //   ),
      //   steps: [
      //     SurgeryStep["anastezia-90"],
      //     SurgeryStep["2much-fluid"],
      //     SurgeryStep["laser-clean"],
      //     SurgeryStep.stabilization,
      //     SurgeryStep["recomend-drops"],
      //   ],
      // },
      {
        name: "Факоемульсифікація катаракти з імплантацією інтраокулярної лінзи",
        desc: (
          <p>
            Проводиться пацієнтам з набухаючою катарактою або віковим
            збільшенням кришталика у випадку закритокутової глаукоми.
          </p>
        ),
        steps: [
          SurgeryStep.anastezia,
          SurgeryStep.alcon,
          SurgeryStep.ultrasound,
          SurgeryStep.introlens,
          SurgeryStep.afterlens,
        ],
      },
      {
        name: "Транссклеральна циклофотокоагуляція лазером",
        desc: (
          <>
            <p>
              Лазерне лікування глаукоми використовують у наступних випадках:
            </p>
            <ul>
              <li>Дуже розвинена, термінальна некомпенсована глаукома.</li>
              <li>Рефрактерна глаукома.</li>
              <li>
                Неможливість проведення проникаючих операцій у зв’язку з високим
                ризиком рубцювання.
              </li>
            </ul>
          </>
        ),
        steps: [
          SurgeryStep["open-eye"],
          SurgeryStep["anastezia-behind-eye"],
          SurgeryStep["laser-bake"],
          SurgeryStep["pressure-down"],
          SurgeryStep["close-eye-back"],
        ],
      },
    ],
  },
  {
    type: PageBlock.instruction,
    title: "Рекомендації з підготовки до операції",
    options: [
      {
        text: "Пройти спеціалізовану діагностику.",
        icon: InstructionIcon["diagnostic"],
      },
      {
        text: "За 7 днів до операції відмовитись від використання контактних лінз.",
        icon: InstructionIcon["no-contacts"],
      },
      {
        text: "Не вживати алкоголь чи седативні препарати, які можуть викликати сонливість.",
        icon: InstructionIcon["no-pills-drink"],
      },
      {
        text: "Взяти з собою сонцезахисні окуляри.",
        icon: InstructionIcon["sunglasses"],
      },
      {
        text: "У день проведення процедури прийняти душ, не користуватись парфумами.",
        icon: InstructionIcon["no-perfume"],
      },
      {
        text: "Відмовитись від куріння в день проведення процедури.",
        icon: InstructionIcon["no-smoking"],
      },
      {
        text: "Прийняти всі ліки при супутніх захворюваннях.",
        icon: InstructionIcon["pills"],
      },
      {
        text: "Закрапати усі краплі, які ви звичайно закрапуєте.",
        icon: InstructionIcon["eye-drops"],
      },
      {
        text: "Протягом двох днів перед процедурою утриматись від застосування косметики.",
        icon: InstructionIcon["no-makeup"],
      },
      {
        text: "Прийти з супроводжуючою особою.",
        icon: InstructionIcon["help"],
      },
      {
        text: "Немає обмежень в прийомі їжі, воду споживайте як зазвичай.",
        icon: InstructionIcon["food"],
      },
    ],
  },
  {
    type: PageBlock.instruction,
    title: "Рекомендації по догляду після хірургії глаукоми",
    options: [
      {
        text: "Протягом 10 днів не можна торкатися ока.",
        icon: InstructionIcon["no-touch"],
      },
      {
        text: "Протягом 14 днів очі можна протирати стерильними серветками.",
        icon: InstructionIcon["wipes"],
      },
      {
        text: "Дотримуйтесь схеми застосування післяопераційних крапель та медикаментів.",
        icon: InstructionIcon["eye-drops"],
      },
      {
        text: "Протягом 14 днів після операції уникати потрапляння в очі води та миючих засобів.",
        icon: InstructionIcon["no-wash"],
      },
      {
        text: "Після процедури можна дивитись телевізор, ходити в кіно, театр, музей.",
        icon: InstructionIcon["tv"],
      },
      {
        text: "Алкогольні напої заборонено вживати впродовж місяця.",
        icon: InstructionIcon["no-alco"],
      },
      {
        text: "Не сідайте за кермо поки зір повністю не відновиться.",
        icon: InstructionIcon["no-drive"],
      },
      {
        text: "Їжа може бути звичайною.",
        icon: InstructionIcon["food"],
      },
      {
        text: "Уникайте підйому важких речей та активного спорту протягом місяця після процедури.",
        icon: InstructionIcon["no-sports"],
      },
    ],
  },
  {
    type: PageBlock.scrollCards,
    title: "Переваги лікування глаукоми в нашій клініці",
    cards: [
      {
        img: "/img/services/khirurgiya-glaukomi/top-devices.jpeg",
        name: "Високоякісне обладнання",
        desc: "Ми постійно інвестуємо в покращення апаратів для лазерного та хірургічного лікування глаукоми. Пацієнтам доступні новітні малоінвазивні методи лікування з високою ефективністю та мінімальними ризиками.",
      },
      {
        img: "/img/services/khirurgiya-glaukomi/comfort.jpeg",
        name: "Зручне обслуговування",
        desc: "Спеціалісти медичного центру допоможуть вам вибрати оптимальний час для діагностики зору та консультації лікаря. Вони докладно розкажуть про підготовку до операції та про правила реабілітації.",
      },
      {
        img: "/img/services/khirurgiya-glaukomi/professionals.jpeg",
        name: "Професійні лікарі",
        desc: "Наша команда — це головна цінність клініки. Кожен з наших спеціалістів відданий своїй справі — вони постійно підвищують кваліфікацію, щоб вибирати кращі методи лікування для пацієнтів.",
      },
    ],
  },
] as TypePageBlocks[];
