import { ThumbsDown, ThumbsUp } from "lucide-react";

import {
  TextIcon,
  PageBlock,
  SurgeryStep,
  TypePageBlocks,
  InstructionIcon,
} from "../shared/PageBlocks/interfaces";

export default [
  {
    type: PageBlock.info,
    body: (
      <>
        <h2 className="not-prose">Що таке катаракта?</h2>
        <p>
          Катаракта — це захворювання, яке супроводжується помутнінням
          кришталика ока, і значно зменшує гостроту зору. Людина бачить світ
          навколо тьмяним — об’єкти мутніють, розпливаються, втрачають яскраві
          кольори. Лікування катаракти слід розпочинати якомога раніше — чим
          швидше відбудеться заміна помутнілого кришталика, тим краще вдасться
          відновити зір і тим коротшим буде реабілітаційний період.
        </p>
      </>
    ),
    step: SurgeryStep["cloudy-lens"],
  },
  {
    type: PageBlock.info,
    img: {
      url: "/img/services/khirurgiya-katarakti/cataract-risks.jpeg",
      alt: "Фактори ризику катаракти",
    },
    body: (
      <>
        <h2 className="not-prose">Фактори ризику катаракти</h2>
        <p>
          Зазвичай катаракта розвивається у пацієнтів літнього віку — понад 60
          років. Але вона може проявлятися і раніше — в тому числі у дітей.
          Існує й вроджена катаракта у немовлят.
        </p>
        <p>Розвиток катаракти можуть прискорювати наступні фактори:</p>
        <ul>
          <li>приймання певних препаратів, особливо кортикостероїдів</li>
          <li>розлади обміну речовин — у тому числі діабет</li>
          <li>вживання алкоголю, нікотину та токсичних речовин</li>
          <li>вплив іонізуючого випромінювання</li>
          <li>генетичні розлади</li>
          <li>травми та удари електричним струмом</li>
        </ul>
      </>
    ),
  },
  {
    type: PageBlock.info,
    reverse: true,
    blurCompare: [
      {
        img: {
          url: "/img/services/khirurgiya-katarakti/kataracta-free.jpeg",
          alt: "Приклад здорового зору",
        },
        label: "здоровий",
        icon: <ThumbsUp />,
      },
      {
        img: {
          url: "/img/services/khirurgiya-katarakti/kataracta-sick.jpeg",
          alt: "Приклад хворого зору",
        },
        label: "хворий",
        icon: <ThumbsDown />,
      },
    ],
    body: (
      <>
        <h2 className="not-prose">Симптоми та прояви катаракти</h2>
        <p>
          Більшість пацієнтів відчуває поступове зниження гостроти зору, що не
          супроводжується болем та іншими симптомами. Зазвичай люди скаржаться
          на помутніння об’єктів.
        </p>
        <p>
          Лікування катаракти ока підбором лінз та окулярів є неефективним —
          вони не можуть компенсувати помутніння кришталика.
        </p>
      </>
    ),
  },
  {
    type: PageBlock.info,
    body: (
      <>
        <h2 className="not-prose">Яке існує лікування катаракти?</h2>
        <p>
          Єдиний ефективний метод видалення катаракти сьогодні — хірургічний.
          Він полягає у видаленні помутнілого кришталика та його заміну штучним
          — спеціальною інтраокулярною лінзою, яка підбирається індивідуально
          для кожного пацієнта. У середньому операція триває близько 15 хвилин і
          не потребує загальної анестезії. Вона абсолютно безпечна та має
          доведену ефективність — таке лікування вже допомогло мільйонам людей у
          цілому світі.
        </p>
        <p>
          Якщо у вас катаракта, ми рекомендуємо не зволікати. Чим пізніше
          пацієнт звертається за допомогою, тим складнішою є діагностика та
          підбір штучного кришталика, довше триває реабілітація та важче
          проходить оперативне втручання. Звертаючись якомога швидше, ви
          мінімізуєте ймовірність ускладнень і зберігаєте максимальну гостроту
          зору.
        </p>
      </>
    ),
    img: {
      url: "/img/services/khirurgiya-katarakti/сataracta-treatment.jpeg",
      alt: "Яке існує лікування катаракти",
    },
  },
  {
    type: PageBlock.info,
    reverse: true,
    body: (
      <>
        <h2 className="not-prose">Вибір штучного кришталика</h2>
        <p>
          Інтраокулярна лінза (штучний кришталик) підбирається індивідуально для
          кожної людини.
        </p>
        <p>Її форма та характеристики враховують:</p>
        <ul>
          <li>особливості будови вашого ока</li>
          <li>наявність короткозорості, далекозорості, астигматизму</li>
          <li>стан здоров’я, наявність хронічних захворювань</li>
          <li>побажання та рід занять пацієнта</li>
        </ul>
        <p>
          Такий підхід забезпечує ефективну корекцію зору. Він дає чудові
          результати у довгостроковій перспективі, дозволяючи людині вести
          звичний спосіб життя.
        </p>
      </>
    ),
    img: {
      url: "/img/services/khirurgiya-katarakti/intra-lens.jpeg",
      alt: "Яке існує лікування катаракти",
    },
  },
  {
    type: PageBlock.info,
    img: {
      url: "/img/services/khirurgiya-katarakti/trifocal.jpeg",
      alt: "Трифокальна лінза",
    },
    body: <h2 className="not-prose">Трифокальна лінза</h2>,
    textIcons: [
      TextIcon.knitting,
      TextIcon.writing,
      TextIcon["makeup-apply"],
      TextIcon.cooking,
      TextIcon["work-on-pc"],
      TextIcon.gaming,
      TextIcon["cell-use"],
      TextIcon["traffic-signs"],
      TextIcon.sightseeing,
    ],
  },
  {
    type: PageBlock.info,
    reverse: true,
    img: {
      url: "/img/services/khirurgiya-katarakti/edof.jpeg",
      alt: "EDOF лінза",
    },
    body: <h2 className="not-prose">EDOF лінза</h2>,
    textIcons: [
      TextIcon.cooking,
      TextIcon["work-on-pc"],
      TextIcon.gaming,
      TextIcon["cell-use"],
      TextIcon["traffic-signs"],
      TextIcon.sightseeing,
    ],
  },
  {
    type: PageBlock.info,
    img: {
      url: "/img/services/khirurgiya-katarakti/monofocal.jpeg",
      alt: "Монофокальна лінза",
    },
    body: <h2 className="not-prose">Монофокальна лінза</h2>,
    textIcons: [
      TextIcon["watch-tv"],
      TextIcon["traffic-signs"],
      TextIcon.sightseeing,
    ],
  },
  {
    type: PageBlock.accordion,
    carouselName: "Етапи операції",
    carousel: [
      SurgeryStep.anastezia,
      SurgeryStep.alcon,
      SurgeryStep.ultrasound,
      SurgeryStep.introlens,
      SurgeryStep.afterlens,
    ],
    accordion: [
      {
        name: "Процес хірургічного лікування катаракти",
        desc: (
          <>
            <p>
              Операція проводиться під місцевою анестезією — ваше око буде
              надійно знеболене краплями, але ви будете перебувати у свідомості.
              Під час операції лікар фіксує повіки та за допомогою сучасної
              ультразвукової системи Oertli (Швейцарія) видаляє помутнілий
              кришталик та імплантує обрану вами інтраокулярну лінзу.
            </p>
            <p>
              Середній час операції — близько 15 хвилин. Того ж дня ви зможете
              повернутися додому та продовжити займатися звичними справами, але
              з кращим зором за умови дотримання усіх рекомендацій лікаря.
            </p>
          </>
        ),
      },
    ],
  },
  {
    type: PageBlock.instruction,
    title: "Рекомендації з підготовки до операції",
    options: [
      {
        text: "Пройти спеціалізовану діагностику.",
        icon: InstructionIcon["diagnostic"],
      },
      {
        text: "За 7 днів до операції відмовитись від використання контактних лінз.",
        icon: InstructionIcon["no-contacts"],
      },
      {
        text: "Не вживати алкоголь чи седативні препарати, які можуть викликати сонливість.",
        icon: InstructionIcon["no-pills-drink"],
      },
      {
        text: "Взяти з собою сонцезахисні окуляри.",
        icon: InstructionIcon["sunglasses"],
      },
      {
        text: "У день проведення процедури прийняти душ, не користуватись парфумами.",
        icon: InstructionIcon["no-perfume"],
      },
      {
        text: "Відмовитись від куріння в день проведення процедури.",
        icon: InstructionIcon["no-smoking"],
      },
      {
        text: "Прийняти всі ліки при супутніх захворюваннях.",
        icon: InstructionIcon["pills"],
      },
      {
        text: "Закрапати усі краплі, які ви звичайно закрапуєте.",
        icon: InstructionIcon["eye-drops"],
      },
      {
        text: "Протягом двох днів перед процедурою утриматись від застосування косметики.",
        icon: InstructionIcon["no-makeup"],
      },
      {
        text: "Прийти з супроводжуючою особою.",
        icon: InstructionIcon["help"],
      },
      {
        text: "Немає обмежень в прийомі їжі, воду споживайте як зазвичай.",
        icon: InstructionIcon["food"],
      },
    ],
  },
  {
    type: PageBlock.instruction,
    title: "Рекомендації по догляду після хірургії катаракти",
    options: [
      {
        text: "Протягом 10 днів не можна торкатися ока.",
        icon: InstructionIcon["no-touch"],
      },
      {
        text: "Протягом 14 днів очі можна протирати стерильними серветками.",
        icon: InstructionIcon["wipes"],
      },
      {
        text: "Дотримуйтесь схеми застосування післяопераційних крапель та медикаментів.",
        icon: InstructionIcon["eye-drops"],
      },
      {
        text: "Протягом 14 днів після операції уникати потрапляння в очі води та миючих засобів.",
        icon: InstructionIcon["no-wash"],
      },
      {
        text: "Протягом одного місяця утриматись від відвідування басейну, лазні.",
        icon: InstructionIcon["no-swim"],
      },
      {
        text: "Утримайтесь від використання макіяжу, косметики протягом 14 днів.",
        icon: InstructionIcon["no-makeup"],
      },
      {
        text: "Після процедури можна дивитись телевізор, ходити в кіно, театр, музей.",
        icon: InstructionIcon["tv"],
      },
      {
        text: "Алкогольні напої заборонено вживати впродовж місяця.",
        icon: InstructionIcon["no-alco"],
      },
      {
        text: "Не сідайте за кермо поки зір повністю не відновиться.",
        icon: InstructionIcon["no-drive"],
      },
      {
        text: "Немає обмежень в прийомі їжі, воду споживайте як зазвичай.",
        icon: InstructionIcon["food"],
      },
      {
        text: "Уникайте підйому важких речей та активного спорту протягом місяця після процедури.",
        icon: InstructionIcon["no-sports"],
      },
      {
        text: "Протягом місяця після операції можлива світло чутливість - одягайте сонцезахисні окуляри.",
        icon: InstructionIcon["sunglasses"],
      },
    ],
  },
  {
    type: PageBlock.scrollCards,
    title: "Чому варто обрати для лікування центр Дмитра Горячева?",
    cards: [
      {
        img: "/img/services/khirurgiya-katarakti/new-kataracta-methods.jpeg",
        name: "Новітні методики лікування",
        desc: "Всі операції проводяться на сучасному обладнанні, яке дозволяє хірургу забезпечити найвищу якість операції, швидку реабілітацію та миттєвий ефект покращення зору, операції проводяться висококваліфікованими хірургами з багаторічним стажем.",
      },
      {
        img: "/img/services/khirurgiya-katarakti/new-kataracta-methods-2.jpeg",
        name: "Новітні методики діагностики та підбору інтраокулярних лінз",
        desc: "Передопераційні обстеження на найсучаснішому обладнанні, яке враховує індивідуальні показники пацієнта, та допомагає підібрати інтраокулярні лінзи, які по максимуму задовольнять потреби пацієнта",
      },
      {
        img: "/img/services/khirurgiya-katarakti/doc-skills.jpeg",
        name: "Висока кваліфікація лікарів",
        desc: "Наші офтальмологи регулярно проходять додаткове навчання, обмінюються досвідом з колегами та відвідують профільні заходи міжнародного рівня. Хірурги клініки — лікарі вищої категорії з досвідом понад 15 років, які проходять стажування за кордоном у Швейцарії, Британії та США.",
      },
      {
        img: "/img/services/khirurgiya-katarakti/social-responsibility.jpeg",
        name: "Соціальна відповідальність",
        desc: "Керівництво клініки з повагою ставиться до співробітників, пацієнтів. Ми надаємо працівникам чудові умови кар’єрного зростання, забезпечуємо бездоганну якість послуг для клієнтів і беремо участь у благодійних проєктах.",
      },
    ],
  },
] as TypePageBlocks[];
