import { ThumbsDown, ThumbsUp } from "lucide-react";

import {
  PageBlock,
  SurgeryStep,
  TypePageBlocks,
  InstructionIcon,
} from "../shared/PageBlocks/interfaces";

export default [
  {
    type: PageBlock.accordion,
    accordion: [
      {
        name: "Що таке косоокість?",
        desc: (
          <>
            <p>
              Косоокість — відхилення одного або обох очей від зорової осі.
              Зазвичай воно призводить до серйозного зниження гостроти зору,
              оскільки людина не може нормально фокусуватися на зображенні
              одночасно обома очима.
            </p>
            <p>
              У важких випадках мозок може отримувати картинку лише з одного
              ока, на іншому розвивається амбліопія, або ліниве око. Чим пізніше
              діагностована амбліопія та чим важчий її ступінь, тим нижчої
              гостроти зору ми досягнемо при лікуванні. Тому вчасна діагностика
              є критично важливою.
            </p>
          </>
        ),
      },
    ],
    carousel: [SurgeryStep["strabismus-eye"], SurgeryStep["no-strabismus"]],
  },
  {
    type: PageBlock.info,
    reverse: true,
    blurCompare: [
      {
        img: {
          url: "/img/services/khirurgiya-kosookosti/strabismus-free.jpeg",
          alt: "Здоровий вигляд",
        },
        label: "здоровий",
        icon: <ThumbsUp />,
      },
      {
        img: {
          url: "/img/services/khirurgiya-kosookosti/strabismus-sick.jpeg",
          alt: "Хворий вигляд",
        },
        label: "хворий",
        icon: <ThumbsDown />,
      },
    ],
    body: (
      <>
        <h2 className="not-prose">Види косоокості</h2>
        <p>
          Косоокість може бути як вродженою (первинною), так і набутою протягом
          життя (вторинною). Ця проблема добре вивчена наукою, яка виділяє
          наступні типи патології:
        </p>
        <ul>
          <li>
            за площиною відхилення — вертикальну та горизонтальну косоокість
          </li>
          <li>за характером проявів — постійну та періодичну</li>
          <li>
            за напрямком відхилення — езотропію (збіжну), коли око відхилене до
            центру обличчя та екзотропію (розбіжну), коли око косить назовні
          </li>
          <li>
            за походженням — акомодаційну та неакомодаційну косоокість. Перша
            розвивається внаслідок короткозорості чи далекозорості високого
            ступеня, коли організм намагається компенсувати порушення зору.
            Друга викликана іншими причинами, а тому важче піддається корекції
          </li>
          <li>
            за механізмом виникнення — паретичну (неспівдружну) та співдружну.
            При паретичній косоокості внаслідок порушення іннервації окорухового
            мʼязу відсутні рухи в певних напрямках, на відміну від співдружньої
          </li>
        </ul>
      </>
    ),
  },
  {
    type: PageBlock.info,
    img: {
      url: "/img/services/khirurgiya-kosookosti/straubismus-causes.jpeg",
      alt: "Причини виникнення косоокості",
    },
    body: (
      <>
        <h2 className="not-prose">Причини виникнення косоокості</h2>
        <p>
          Основна причина розвитку косоокості — неузгоджена робота м’язів, що
          рухають очі людини. Найчастіше вона виникає у ранньому віці. Варто
          відзначити, що вчасне лікування косоокості у дітей дозволяє
          сповільнити чи навіть повністю зупинити зниження гостроти зору, а
          також уникнути розвитку амбліопії.
        </p>
        <p>До причини виникнення косоокості також відносять:</p>
        <ul>
          <li>занедбані захворювання очей різного походження</li>
          <li>травми та порушення нервової провідності</li>
          <li>захворювання головного мозку та нервової системи</li>
          <li>ендокринна офтальмопатія</li>
          <li>прийом певних препаратів</li>
        </ul>
      </>
    ),
  },
  {
    type: PageBlock.info,
    reverse: true,
    img: {
      url: "/img/services/khirurgiya-kosookosti/strabismus-tests.jpeg",
      alt: "Симптоми та діагностика косоокості",
    },
    body: (
      <>
        <h2 className="not-prose">Симптоми та діагностика косоокості</h2>
        <p>
          Наявність косоокості можуть помітити батьки або лікар на
          профілактичному огляді. Якщо у ранньому віці не пролікувати
          косоокість, втрачається бінокулярний, стереоскопічний зір та
          розвивається амбліопія (ліниве око).
        </p>
        <p>
          Симптоми відрізняються залежно від виду косоокості — очі можуть косити
          в стані спокою, або під час стресових ситуацій. Якщо кут косоокості
          доволі малий і проблема виникає тільки в певних обставинах, побачити
          її ззовні буде складніше. В більшості випадків дитина ніколи не
          скаржиться на погіршення зору, тому батькам слід особливо серйозно
          ставитись до профілактичних оглядів.
        </p>
        <p>Симптоми:</p>
        <ul>
          <li>
            суттєва різниця у чіткості зору обох очей — її можна виявити,
            закриваючи очі по черзі
          </li>
          <li>нечіткість зору — розмитість, димку, двоїння предметів</li>
          <li>
            швидку втомлюваність, постійне подразнення очей, головний біль
          </li>
          <li>неправильне положення голови (кривошию)</li>
        </ul>
      </>
    ),
  },
  {
    type: PageBlock.scrollCards,
    title: "Методи лікування та корекції косоокості в нашому центрі",
    cards: [
      {
        img: "/img/services/khirurgiya-kosookosti/glasses-correction.jpeg",
        name: "Окулярна корекція",
        desc: "Ефективний і єдиний метод лікування косоокості акомодаційного типу — особливо у дітей раннього віку. Діткам необхідно постійно користуватись окулярами, а з чотирьох років можна і мʼякими контактними лінзами.",
      },
      {
        img: "/img/services/khirurgiya-kosookosti/operation.jpeg",
        name: "Хірургічне лікування",
        desc: "Найефективніший метод корекції косоокості неакомодаційного типу та частково акомодаційній косоокості. Хірургія виправляє положення очей і дає можливість досягти вищого зору у комплексі з апаратним лікуванням. Найбільш сприятливим часом для хірургічного лікування є дошкільний вік — краща нейроадаптація мозку, швидша реабілітація під час раннього післяопераційного періоду, можливість відновлення бінокулярного зору.",
      },
      {
        img: "/img/services/khirurgiya-kosookosti/sight-teraphy.jpeg",
        name: "Зорова терапія",
        desc: "Допоміжний метод виправлення косоокості у дорослих і дітей, який використовується у післяопераційному періоді для легшої нейроадаптації та обов’язково застосовується для лікування амбліопії. Він прискорює адаптацію нервової системи та дозволяє знову навчити мозок сприймати зображення від обох очей.",
      },
    ],
  },
  {
    type: PageBlock.instruction,
    title: "Передопераційні рекомендації хірургії косоокості",
    options: [
      {
        text: "За 6 год до операції не їсти і не пити.",
        icon: InstructionIcon["dont-eat"],
      },
      {
        text: "За 5 днів здати відповідні амбулаторні аналізи.",
        icon: InstructionIcon["list"],
      },
      {
        text: "Дитині можна взяти улюблену іграшку з собою в операційну.",
        icon: InstructionIcon["toy"],
      },
    ],
  },
  {
    type: PageBlock.instruction,
    title: "Післяопераційні рекомендації хірургії косоокості",
    options: [
      {
        text: "Закрапувати краплі відповідно рекомендацій лікаря.",
        icon: InstructionIcon["eye-drops"],
      },
      {
        text: "Протягом 3-4 днів вмиватись та мити голову так, щоб вода не потрапляла в проопероване око.",
        icon: InstructionIcon["no-wash"],
      },
      {
        text: "Не плавати в басейні або природних водоймах протягом місяця після операції.",
        icon: InstructionIcon["no-swim"],
      },
      {
        text: "На вулиці опероване око захищати оклюдором 3 дні після операції.",
        icon: InstructionIcon["special-glasses"],
      },
      {
        text: "Їжа може бути звичайною.",
        icon: InstructionIcon.food,
      },
      {
        text: "Можна дивитись телевізор, малювати, читати, лише не забувати систематично закрапувати краплі.",
        icon: InstructionIcon.tv,
      },
      {
        text: "Окуляри можна носити за 2-3 дні або відразу.",
        icon: InstructionIcon.sunglasses,
      },
    ],
  },
  {
    type: PageBlock.scrollCards,
    title: "Чому варто звернутись саме в офтальмологічний центр Д. Горячева?",
    cards: [
      {
        img: "/img/services/khirurgiya-kosookosti/technologies.jpeg",
        name: "Сучасні технології",
        desc: "Ми використовуємо новітні методи діагностики та лікування косоокості у дорослих і дітей. Наш офтальмологічний центр постійно інвестує у підвищення кваліфікації спеціалістів і купівлю сучасного обладнання.",
      },
      {
        img: "/img/services/khirurgiya-kosookosti/top-job.jpeg",
        name: "Справжній професіоналізм",
        desc: "Наші лікарі — це не просто колектив, це команда відданих своїй справі спеціалістів. Вони індивідуально вивчають кожен випадок і підбирають найкращі методи лікування для кожного пацієнта — швидкі, безпечні та ефективні.",
      },
      {
        img: "/img/services/khirurgiya-kosookosti/soc-resp.jpeg",
        name: "Соціальна відповідальність",
        desc: "Офтальмологічний центр Дмитра Горячева працює офіційно та повною мірою сплачує податки. Наша клініка бере участь у низці благодійних проєктів у сфері освіти, а також розвитку культури та спорту.",
      },
    ],
  },
] as TypePageBlocks[];
