import {
  PageBlock,
  SurgeryStep,
  TypePageBlocks,
  InstructionIcon,
} from "../shared/PageBlocks/interfaces";

export default [
  {
    type: PageBlock.info,
    body: (
      <>
        <h2 className="not-prose">Будова та функції сітківки</h2>
        <p>
          Сітківка — це тонка внутрішня оболонка ока, що містить мільйони
          світлочутливих клітин (палички та колбочки), які отримують зорову
          інформацію. Саме сітківка перетворює світлові сигнали у нервовий
          імпульс, передає цю інформацію у головний мозок через зоровий нерв та
          зорові шляхи.
        </p>
        <p>
          Центральна зона сітківки — макула — відповідає за центральний зір,
          периферія — за просторовий, периферичний зір. У залежності від
          локалізації ураження змінюються симптоми захворювання та тактика
          лікування. Без лікування більшість захворювань сітківки можуть
          призвести до значної втрати зору або сліпоти.
        </p>
      </>
    ),
    step: SurgeryStep["retina"],
  },
  {
    type: PageBlock.info,
    reverse: true,
    img: {
      url: "/img/services/khirurgiya-zakhvoryuvan-sitkivki/retina-scans.jpeg",
      alt: "Діагностикф хвороб сітківки",
    },
    body: (
      <>
        <h2 className="not-prose">
          Які обстеження необхідні для діагностики хвороб сітківки?
        </h2>
        <p>
          При підозрі на захворювання сітківки проводиться розширена діагностика
          із застосуванням наступних методів:
        </p>
        <ul>
          <li>
            оптична когерентна томографія (ОКТ) — безконтактний метод
            дослідження, який дозволяє побачити мінімальні зміни в структурі
            сітківки
          </li>
          <li>
            ангіо-ОКТ — метод дослідження, який дозволяє отримати точне
            зображення мікросудинного русла у шарах сітківки та судинної
            оболонки
          </li>
          <li>
            УЗД очного яблука — метод діагностики для виявлення аномалій тканин
            ока
          </li>
          <li>
            фотофіксація очного дна — метод, який дозволяє зробити панорамний
            знімок очного дна для моніторингу стану
          </li>
        </ul>
      </>
    ),
  },
  {
    type: PageBlock.accordion,
    title: "Захворювання сітківки",
    accordion: [
      {
        name: "Епімакулярна мембрана",
        desc: (
          <>
            <p>
              Епіретинальна мембрана — це тонка&nbsp; плівка, яка утворюється в
              центральній зоні сітківки, може призвести до розриву сітківки,
              набряку в макулярній ділянці. Ризик утворення епіретинальної
              мембрани збільшується з віком однаково в чоловіків та жінок;&nbsp;
              може бути ідіопатичною&nbsp; (виникає без причин), або пов’язаною
              із іншою патологією очей (судинні хвороби сітківки, травми,
              запальні захворювання).
            </p>
            <p>Які симптоми?</p>
            <ul>
              <li>Зниження зору</li>
              <li>Викривлення та спотворення предметів (метаморфопсія)</li>
              <li>Туманність перед оком</li>
            </ul>
            <p>Лікування хірургічним шляхом — вітректомія.</p>
          </>
        ),
        img: "/img/services/khirurgiya-zakhvoryuvan-sitkivki/epi-membran.jpeg",
      },
      {
        name: "Макулярна дірка",
        desc: (
          <>
            <p>
              Макулярна дірка — це захворювання, яке характеризується
              набутим&nbsp; розривом сітківки в центральній&nbsp; ділянці.
              Причиною виникнення є патологічне міцне з'єднання сітківки зі
              скловидним тілом, що наповнює око. Це призводить до натягу
              сітківки та утворення дірки.
            </p>
            <p>Які симптоми?</p>
            <ul>
              <li>Зниження гостроти зору.</li>
              <li>
                Викривлення та спотворення предметів (метаморфопсія), наприклад
                рядок слів в газеті стає викривленим або частина букв зникає.
              </li>
              <li>Темна пляма&nbsp; в центрі поля зору.</li>
            </ul>
            <p>Лікування хірургічним шляхом&nbsp; — вітректомія.</p>
          </>
        ),
        img: "/img/services/khirurgiya-zakhvoryuvan-sitkivki/mac-hole.jpeg",
      },
      {
        name: "Діабетична ретинопатія",
        desc: (
          <>
            <p>
              Діабетична ретинопатія — це хронічне захворювання сітківки ока,
              яке розвивається як ускладнення цукрового діабету і являє собою
              прогресуюче пошкодження судин. Хвороба протікає поступово і на
              початку практично безсимптомно, а при появі перших симптомів
              швидко прогресує. Тому люди, котрі хворіють цукровим діабетом,
              повинні проходити профілактичні огляди кожні півроку.
            </p>
            <p>Які симптоми?</p>
            <ul>
              <li>Зниження гостроти зору.</li>
              <li>«Затуманення» зору, поява темного «павутиння» перед оком.</li>
              <li>Поява плям, спотворення ліній та предметів.</li>
            </ul>
            <p>
              Лікування діабетичної ретинопатії — лазерна коагуляція сітківки,
              введення препаратів інгібіторів ФРЕС, хірургічна операція, прийом
              медикаментів для покращення кровопостачання.
            </p>
          </>
        ),
        img: "/img/services/khirurgiya-zakhvoryuvan-sitkivki/diabet-retynopatia.jpeg",
      },
      {
        name: "Вікова макулярна дегенерація",
        desc: (
          <>
            <p>
              Вікова макулярна дегенерація (ВМД) — це захворювання центральної
              частини сітківки ока — макули. ВМД призводить до втрати
              центрального зору, тому пацієнт не розрізняє деталі предметів ні
              здалеку, ні зблизька. Водночас периферійний зір збережений.
              Захворювання протікає у двох формах - сухій та вологій. Суха форма
              потребує спостереження, а волога - без лікування призводить до
              втрати центрального зору.
            </p>
            <p>Які симптоми?</p>
            <ul>
              <li>Зниження гостроти зору.</li>
              <li>Викривлення зображення в центрі зору.</li>
              <li>Поява темних плям.</li>
            </ul>
            <p>
              Лікування — прийом препаратів, що покращують обмін речовин у
              тканинах сітківки, введення інгібіторів ФРЕС.
            </p>
          </>
        ),
        img: "/img/services/khirurgiya-zakhvoryuvan-sitkivki/age-degeneration.jpeg",
      },
      {
        name: "Відшарування сітківки",
        desc: (
          <>
            <p>
              Відшарування сітківки — це стан, який характеризується
              відокремленням сітківки від судинної оболонки. Найчастішою
              причиною відшарування є розрив сітківки, який виникає на фоні її
              дегенерації.
            </p>
            <p>Які симптоми?</p>
            <ul>
              <li>
                Спалахи та блискавки з боку, особливо помітні в сутінках та при
                зміні освітлення.
              </li>
              <li>Чорні нитки та «мушки».</li>
              <li>Відчуття «пелени» або «заслінки» перед оком.</li>
              <li>
                Звуження периферичного зору — втрата зору з периферії до центру.
              </li>
            </ul>
            <p>
              Хірургічне лікування - вітректомія. Операція при відшаруванні
              сітківки ока проводиться негайно, як тільки встановлено діагноз.
              <br />
              Локальне периферичне відшарування обмежовується лазеркоагуляцією
              сітківки.
            </p>
          </>
        ),
        img: "/img/services/khirurgiya-zakhvoryuvan-sitkivki/retina-slicing.jpeg",
      },
    ],
  },
  {
    type: PageBlock.accordion,
    carouselName: "Етапи операції",
    stepsOut: true,
    accordion: [
      {
        name: "Лазерне лікування сітківки",
        desc: (
          <p>
            Лазерна коагуляція сітківки — амбулаторний, малоінвазивний метод
            лікування, який полягає в утворенні рубців між сітківкою та судинною
            оболонкою ока. Профілактична периферична лазерна коагуляція
            застосовується при злоякісних периферичних дегенераціях сітківки,
            обмежувальна — при розривах та локальному відшаруванні сітківки,
            панретинальна — при судинних патологіях (діабетична ретинопатія та
            оклюзія центральної вени сітківки). Вчасно проведена лазерна
            коагуляція сітківки дозволяє попередити відшарування сітківки, та
            втрату зору при цукровому діабеті.
          </p>
        ),
        steps: [
          SurgeryStep["anastezia-90"],
          SurgeryStep["enlarged-anastezia"],
          SurgeryStep["lens-setup"],
          SurgeryStep["laser-impuls"],
          SurgeryStep["lens-remove"],
        ],
      },
      {
        name: "Хірургічне лікування сітківки",
        desc: (
          <>
            <p>
              Лікування більшості патологій сітківки вимагають вітреоретинальної
              хірургії. Вітректомія — це хірургічна операція при відшаруванні
              сітківки ока та інших патологіях, спрямована на відновлення
              анатомічного та функціонального стану сітківки. Операція
              проводиться в амбулаторних умовах під місцевою анестезією, в
              окремих випадках — під загальним наркозом.
            </p>
            <p>
              У Офтальмологічному центрі Дмитра Горячева вітректомію проводимо
              на операційному комбайні останнього покоління Oertli OS4
              (Швейцарія) та єдиній в Україні системі 3D візуалізації Ngenuity,
              що забезпечує максимально якісні післяопераційні результати
              скорочує час оперативного втручання та полегшує реабілітацію.
            </p>
          </>
        ),
        steps: [
          SurgeryStep.anastezia,
          SurgeryStep["open-eye"],
          SurgeryStep["3cut"],
          SurgeryStep["tools-in"],
          SurgeryStep["vitreous-out"],
          SurgeryStep["gas-in"],
          SurgeryStep["retina-ok"],
          SurgeryStep["operation-end"],
        ],
      },
      {
        name: "Внутрішньоочне введення",
        desc: (
          <p>
            Амбулаторний, малоінвазивний метод, що полягає у внутрішньоочному
            введенні препарату, необхідного для лікування захворювання сітківки
            пацієнта.
            <br />
            Ми використовуємо лише офіційно дозволені в Україні ліки для
            внутрішньо очного введення: Вабісмо (Фарицимаб), Айлія
            (Афліберсепт), Візкью (Бролуцизумаб), Озурдекс.
            <br />
            Ці препарати застосовують для лікування ВМД (волога форма),
            діабетичного макулярного набряку, діабетичної ретинопатії, оклюзії
            центральної вени сітківки або гілки ЦВС, дегенеративній міопії та
            інших захворювань сітківки. Доцільність застосування даного методу
            лікування визначає лікар-офтальмолог індивідуально для кожного
            випадку.
          </p>
        ),
        steps: [
          SurgeryStep.anastezia,
          SurgeryStep.microneedle,
          SurgeryStep.massage,
          SurgeryStep.antibiotics,
        ],
      },
    ],
  },
  {
    type: PageBlock.instruction,
    title: "Передопераційні рекомендації до вітректомії",
    options: [
      {
        text: "Пройти спеціалізовану діагностику.",
        icon: InstructionIcon["diagnostic"],
      },
      {
        text: "За 7 днів до операції відмовитись від використання контактних лінз.",
        icon: InstructionIcon["no-contacts"],
      },
      {
        text: "Не вживати алкоголь чи седативні препарати, які можуть викликати сонливість.",
        icon: InstructionIcon["no-pills-drink"],
      },
      {
        text: "Взяти з собою сонцезахисні окуляри.",
        icon: InstructionIcon["sunglasses"],
      },
      {
        text: "У день проведення процедури прийняти душ, не користуватись парфумами.",
        icon: InstructionIcon["no-perfume"],
      },
      {
        text: "Відмовитись від куріння в день проведення процедури.",
        icon: InstructionIcon["no-smoking"],
      },
      {
        text: "Прийняти всі ліки при супутніх захворюваннях.",
        icon: InstructionIcon["pills"],
      },
      {
        text: "Закрапати усі краплі, які ви звичайно закрапуєте.",
        icon: InstructionIcon["eye-drops"],
      },
      {
        text: "Протягом двох днів перед процедурою утриматись від застосування косметики.",
        icon: InstructionIcon["no-makeup"],
      },
      {
        text: "Прийти з супроводжуючою особою.",
        icon: InstructionIcon["help"],
      },
      {
        text: "Немає обмежень в прийомі їжі, воду споживайте як зазвичай.",
        icon: InstructionIcon["food"],
      },
    ],
  },
  {
    type: PageBlock.instruction,
    title: "Післяопераційні рекомендації при вітректомії",
    options: [
      {
        text: "Протягом 10 днів не можна торкатися ока.",
        icon: InstructionIcon["no-touch"],
      },
      {
        text: "Протягом 14 днів очі можна протирати стерильними серветками.",
        icon: InstructionIcon["wipes"],
      },
      {
        text: "Дотримуйтесь схеми застосування післяопераційних крапель та медикаментів.",
        icon: InstructionIcon["eye-drops"],
      },
      {
        text: "Протягом 14 днів після операції уникати потрапляння в очі води та миючих засобів.",
        icon: InstructionIcon["no-wash"],
      },
      {
        text: "Протягом місяця після операції можлива світло чутливість - одягайте сонцезахисні окуляри.",
        icon: InstructionIcon["sunglasses"],
      },
      {
        text: "Протягом одного місяця утриматись від відвідування басейну, лазні.",
        icon: InstructionIcon["no-swim"],
      },
      {
        text: "Утримайтесь від використання макіяжу, косметики протягом 14 днів.",
        icon: InstructionIcon["no-makeup"],
      },
      {
        text: "Після процедури можна дивитись телевізор, ходити в кіно, театр, музей.",
        icon: InstructionIcon["tv"],
      },
      {
        text: "Алкогольні напої заборонено вживати впродовж місяця.",
        icon: InstructionIcon["no-alco"],
      },
      {
        text: "Не сідайте за кермо поки зір повністю не відновиться.",
        icon: InstructionIcon["no-drive"],
      },
      {
        text: "Їжа може бути звичайною.",
        icon: InstructionIcon["food"],
      },
      {
        text: "Уникайте підйому важких речей та активного спорту протягом місяця після процедури.",
        icon: InstructionIcon["no-sports"],
      },
    ],
  },
  {
    type: PageBlock.scrollCards,
    title: "Ось чому наші клієнти обирають нас",
    cards: [
      {
        img: "/img/services/khirurgiya-zakhvoryuvan-sitkivki/hiend-clinique.jpeg",
        name: "Постійне вдосконалення клініки",
        desc: "Ми постійно інвестуємо в освоєння нових методів обстеження та лікувальних процедур. Наші пацієнти завжди отримують якісні послуги з мінімальним ризиком і максимальною ефективністю.",
      },
      {
        img: "/img/services/khirurgiya-zakhvoryuvan-sitkivki/top-equipment.jpeg",
        name: "Сучасне обладнання",
        desc: "Для лікування захворювань сітківки ока у Львові у нашій клініці використовуються діагностичні та операційні інструменти провідних світових виробників — Zeiss, Oertli, Alcon та інших.",
      },
      {
        img: "/img/services/khirurgiya-zakhvoryuvan-sitkivki/surgens.jpeg",
        name: "Професіоналізм лікарів",
        desc: "Наші спеціалісти регулярно проходять підвищення кваліфікації, обмінюються досвідом з колегами та беруть участь у профільних заходах національного та міжнародного рівня.",
      },
    ],
  },
] as TypePageBlocks[];
