import {
  PageBlock,
  SurgeryStep,
  TypePageBlocks,
  InstructionIcon,
} from "../shared/PageBlocks/interfaces";

export default [
  {
    type: PageBlock.accordion,
    title: "Покази до лазерної корекції зору",
    accordion: [
      {
        name: "Міопія",
        desc: (
          <p>
            Міопія або короткозорість — це аномалія рефракції, при якій світлові
            промені фокусуються неправильно: не на сітківці ока, а перед нею.
            Вона виникає тоді, коли око має більшу довжину ніж в нормі або коли
            рогівка чи кришталик має більшу заломлювальну силу ніж потрібно. В
            такому випадку людина добре бачить зблизька, проте вдалечінь бачить
            погано.
          </p>
        ),
        img: "/img/services/lazerna-korektsiya-zoru/miopia.jpeg",
        steps: [SurgeryStep["miopia-eye"]],
      },
      {
        name: "Гіперметропія",
        desc: (
          <>
            <p>
              Гіперметропія, або далекозорість — аномалія рефракції, при якій
              світлові промені фокусуються не на сітківці ока, а поза нею. Вона
              виникає тоді, коли око має меншу довжину ніж в середній популяції
              або при зменшенні заломлюючої сили рогівки- плоскій рогівці.
            </p>
            <p>
              При гіперметропії вдалину зір чіткіший, поблизу картинка
              відображається розмитою і нечіткою. Зір знижується поступово, але
              після 30 років ситуація може різко погіршитися, і зір може
              погіршуватися більш стрімко.
            </p>
          </>
        ),
        img: "/img/services/lazerna-korektsiya-zoru/longsight.jpeg",
        steps: [SurgeryStep["longsight-eye"]],
      },
      {
        name: "Астигматизм",
        desc: (
          <p>
            Астигматизм — це аномалія рефракції, при якій світлові промені не
            фокусуються в одну точку. При астигматизмі людина скаржиться на
            нечіткий зір, який призводить до швидкої втомлюваності — особливо
            при тривалій роботі перед комп’ютером.
          </p>
        ),
        img: "/img/services/lazerna-korektsiya-zoru/astigmatizm.png",
        steps: [SurgeryStep["astigmatism-eye"]],
      },
    ],
  },
  {
    type: PageBlock.info,
    img: {
      url: "/img/services/lazerna-korektsiya-zoru/lazerna-korekcia.png",
      alt: "Лазерна корекція",
    },
    body: (
      <>
        <h2 className="not-prose">
          Лазерна корекція — швидке, безпечне та ефективне відновлення зору
        </h2>
        <p>
          Звертаючись до нашого офтальмологічного центру по лазерну корекцію
          зору у Львові, ви також отримуєте наступні переваги:
        </p>
        <ul>
          <li>
            Універсальність. <br />
            Відновлення гостроти зору лазером дозволяє позбутися більшості
            рефракційних дефектів, таких як короткозорість, далекозорість та
            астигматизм.
          </li>
          <li>
            Швидкість.
            <br />
            Безпосередній вплив лазера на одне око триває до однієї хвилини.
            Загалом на операцію на два ока йде близько 10–15 хвилин.
          </li>
          <li>
            Ефективність.
            <br />У 98% випадків пацієнти повністю відмовляються від додаткової
            корекції контактними лінзами та окулярами. У 2% можлива докорекція.
          </li>
          <li>
            Безпечність.
            <br />
            Лазер WaveLight EX 500 (Alcon, США), який використовується у нашому
            медичному центрі, є одним з найточніших у світі.
          </li>
        </ul>
      </>
    ),
  },
  {
    type: PageBlock.info,
    reverse: true,
    img: {
      url: "/img/services/lazerna-korektsiya-zoru/protypokasu-lazernoi-korekcii.jpeg",
      alt: "Протипокази до лазерної корекції",
    },
    body: (
      <>
        <h2 className="not-prose">
          Які існують протипокази до лазерної корекції?
        </h2>
        <p>
          Офтальмологи не рекомендують проведення процедури в наступних
          випадках:
        </p>
        <ul>
          <li>у віці до 18 років, коли продовжується формування тканин ока</li>
          <li>після 40 років, коли відбуваються вікові зміни кришталика</li>
          <li>при кератоконусі чи ризику його розвитку</li>
          <li>
            при некомпенсованих супутніх хворобах&nbsp; цукрового діабету чи
            захворювань сполучної тканини
          </li>
          <li>при надто тонкій рогівці</li>
          <li>при запальних захворюваннях очей</li>
          <li>у період вагітності та лактації</li>
        </ul>
      </>
    ),
  },
  {
    type: PageBlock.accordion,
    title: "Технології лазерної корекції зору, які ми використовуємо",
    carouselName: "Етапи операції",
    stepsOut: true,
    accordion: [
      // {
      //   name: "WaveLight Plus (Innov eyes)",
      //   desc: (
      //     <>
      //       <p>
      //         Унікальна та найсучасніша методика лазерної корекції на
      //         сьогоднішній день у світі. Хірург створює програму терапії на
      //         основі 3D-моделі органів зору, отриманої за допомогою комп’ютерної
      //         томографії.
      //       </p>
      //       <p>
      //         Процедура показана для пацієнтів, які скаржаться на низьку
      //         чіткість і контрастність зображення навіть після підбору
      //         оптимальних окулярів чи лінз.
      //       </p>
      //     </>
      //   ),
      //   steps: [
      //     SurgeryStep.anastezia,
      //     SurgeryStep["open-eye"],
      //     SurgeryStep.outrocot,
      //     SurgeryStep.prep4laser,
      //     SurgeryStep["laser-retina-cut"],
      //     SurgeryStep["cut-in-place"],
      //     SurgeryStep.lens4sec,
      //     SurgeryStep["close-eye"],
      //   ],
      // },
      // {
      //   name: "LASIK Custom-Q",
      //   desc: (
      //     <>
      //       <p>
      //         Найпопулярніша процедура, що проводиться з використанням
      //         швидкісного ексимерного лазера. Лікар за допомогою спеціального
      //         обладнання мікрокератома <strong>Moria Evolution 3E</strong>{" "}
      //         (Франція) формує на поверхні рогівки супер тонкий лоскут товщиною
      //         100-110 мікронів, та під ним проводить лазерну корекцію.
      //       </p>
      //       <p>
      //         Корекція проводиться під місцевою крапельною анестезією, а тому не
      //         викликає сильних неприємних відчуттів. Після завершення процедури
      //         лоскут повертається на місце.
      //       </p>
      //     </>
      //   ),
      //   steps: [
      //     SurgeryStep.anastezia,
      //     SurgeryStep["open-eye"],
      //     SurgeryStep.outrocot,
      //     SurgeryStep.prep4laser,
      //     SurgeryStep["laser-retina-cut"],
      //     SurgeryStep["cut-in-place"],
      //     SurgeryStep.lens4sec,
      //     SurgeryStep["close-eye"],
      //   ],
      // },
      // {
      //   name: "StreamLight",
      //   desc: (
      //     <>
      //       <p>
      //         Роботизована лазерна корекція зору, що скорочує час операції, не
      //         потребує застосування хірургічних інструментів і додаткових
      //         розчинів.
      //       </p>
      //       <p>
      //         Ця технологія дозволяє позбутися далекозорості, короткозорості та
      //         астигматизму.
      //       </p>
      //     </>
      //   ),
      //   steps: [
      //     SurgeryStep.anastezia,
      //     SurgeryStep["open-eye"],
      //     SurgeryStep["laser-50mkm"],
      //     SurgeryStep["laser-retina-cut"],
      //     SurgeryStep["protective-lense"],
      //     SurgeryStep["close-eye"],
      //   ],
      // },
      {
        name: "ФРК Custom-Q",
        desc: (
          <>
            <p>
              Операція, що дозволяє коригувати високі ступені короткозорості та
              проводити операцію на тонкій рогівці. Після застосування анестезії
              спеціаліст проводить видалення епітелію рогівки за допомогою
              спеціального розчину.
            </p>
            <p>
              Це дозволяє йому швидко та безпечно змінити форму поверхні ока
              лазером. На фінальному етапі процедури накладається захисна лінза,
              яку треба носити 5–6 днів.
            </p>
          </>
        ),
        steps: [
          SurgeryStep.anastezia,
          SurgeryStep["open-eye"],
          SurgeryStep["eye-drops"],
          SurgeryStep["laser-retina-cut"],
          SurgeryStep["protective-lense"],
          SurgeryStep["close-eye"],
        ],
      },
    ],
  },
  {
    type: PageBlock.instruction,
    title: "Рекомендації з підготовки до операції",
    options: [
      {
        text: "Пройти спеціалізовану діагностику.",
        icon: InstructionIcon["diagnostic"],
      },
      {
        text: "За 7 днів до операції відмовитись від використання контактних лінз.",
        icon: InstructionIcon["no-contacts"],
      },
      {
        text: "Не вживати алкоголь чи седативні препарати, які можуть викликати сонливість.",
        icon: InstructionIcon["no-pills-drink"],
      },
      {
        text: "Взяти з собою сонцезахисні окуляри.",
        icon: InstructionIcon["sunglasses"],
      },
      {
        text: "У день проведення процедури прийняти душ, не користуватись парфумами.",
        icon: InstructionIcon["no-perfume"],
      },
      {
        text: "Відмовитись від куріння в день проведення процедури.",
        icon: InstructionIcon["no-smoking"],
      },
      {
        text: "Прийняти всі ліки при супутніх захворюваннях.",
        icon: InstructionIcon["pills"],
      },
      {
        text: "Закрапати усі краплі, які ви звичайно закрапуєте.",
        icon: InstructionIcon["eye-drops"],
      },
      {
        text: "Протягом двох днів перед процедурою утриматись від застосування косметики.",
        icon: InstructionIcon["no-makeup"],
      },
      {
        text: "Прийти з супроводжуючою особою.",
        icon: InstructionIcon["help"],
      },
      {
        text: "Немає обмежень в прийомі їжі, воду споживайте як зазвичай.",
        icon: InstructionIcon["food"],
      },
    ],
  },
  {
    type: PageBlock.instruction,
    title: "Рекомендації після лазерної корекції",
    options: [
      {
        text: "Уникайте потирання очей та сну обличчям в подушку протягом двох тижнів після лазерної корекції.",
        icon: InstructionIcon["no-touch"],
      },
      {
        text: "Протягом 20 днів після операції не наносьте макіяж повік, вій. Уникайте використання косметики навколо очей.",
        icon: InstructionIcon["no-makeup"],
      },
      {
        text: "Протягом певного періоду після операції можлива різна ступінь дискомфорту, сльозотеча. Цей час рекомендовано проводити із закритими очима.",
        icon: InstructionIcon["tears"],
      },
      {
        text: "Одразу після лазерної корекції вам нанесуть захисну контактну лінзу, яку лікар зніме на  5-6 день після операції у клініці.",
        icon: InstructionIcon["contacts"],
      },
      {
        text: "Дотримуйтесь рекомендацій лікаря стосовно використання засобів особистої гігієни, засобів для догляду за волоссям.",
        icon: InstructionIcon["doc"],
      },
      {
        text: "Уникайте потрапляння води в очі під час прийому душу та ванни протягом 20 днів.",
        icon: InstructionIcon["shield"],
      },
      {
        text: "Перші 14 днів після лазерної корекції уникайте накурених, задимлених, запилючених приміщень.",
        icon: InstructionIcon["no-dust"],
      },
      {
        text: "Дотримуйтесь схеми застосування післяопераційних крапель та медикаментів.",
        icon: InstructionIcon["eye-drops"],
      },
      {
        text: "Протягом року після операції у сонячну погоду одягайте сонцезахисні окуляри при операції методом StreamLight і PRK.",
        icon: InstructionIcon["sunglasses"],
      },
      {
        text: "Через 5 днів після лазерної корекції можна працювати за компʼютером.",
        icon: InstructionIcon["pc"],
      },
      {
        text: "Не відвідуйте басейн та сауну 21 день.",
        icon: InstructionIcon["no-swim"],
      },
      {
        text: "Уникайте підйому важких речей та активного спорту впродовж 14 днів після лазерної корекції.",
        icon: InstructionIcon["no-sports"],
      },
      {
        text: "Не сідайте за кермо поки зір повністю не відновиться.",
        icon: InstructionIcon["no-drive"],
      },
    ],
  },
] as TypePageBlocks[];
