import { ThumbsDown, ThumbsUp } from "lucide-react";

import {
  PageBlock,
  SurgeryStep,
  TypePageBlocks,
  InstructionIcon,
} from "../shared/PageBlocks/interfaces";

export default [
  {
    type: PageBlock.accordion,
    accordion: [
      {
        name: "Що таке кератоконус?",
        desc: (
          <>
            <p>
              Кератоконус — незапальне дистрофічне захворювання рогівки, що
              призводить до її стоншення внаслідок зміни форми на конусоподібну.
              На пізніх стадіях розвиток кератоконусу може призвести до значної
              втрати зору та необхідності пересадки рогівки.
            </p>
            <p>
              Для діагностики кератоконусу проводимо ряд обстежень, які
              включають загальні офтальмологічні, а також кератотомографію,
              кератотопографію та ОКТ переднього відрізку ока на спеціальному
              обладнанні.
            </p>
          </>
        ),
      },
    ],
    carousel: [SurgeryStep["keratokonus-eye"], SurgeryStep["normal-sight"]],
  },
  {
    type: PageBlock.info,
    reverse: true,
    img: {
      url: "/img/services/likuvannya-keratokonusu/keratoconus-reasons.jpeg",
      alt: "Причини виникнення цього захворювання",
    },
    body: (
      <>
        <h2 className="not-prose">Причини виникнення цього захворювання</h2>
        <p>
          На жаль, вчені досі не можуть встановити точне походження розвитку
          кератоконусу. Вважається, що основною причиною є генетична схильність.
        </p>
        <p>Фактори ризику:</p>
        <ul>
          <li>звичка потирати очі</li>
          <li>
            супутні захворювання (синдроми Дауна, Елерса-Данлоса, Марфана)
          </li>
          <li>бронхіальна астма</li>
          <li>схильність до атопічного дерматиту та&nbsp;алергічних реакцій</li>
          <li>порушення обміну речовин</li>
        </ul>
      </>
    ),
  },
  {
    type: PageBlock.info,
    blurCompare: [
      {
        img: {
          url: "/img/services/likuvannya-keratokonusu/keratoconus-free.jpeg",
          alt: "Здоровий вигляд",
        },
        label: "здоровий",
        icon: <ThumbsUp />,
      },
      {
        img: {
          url: "/img/services/likuvannya-keratokonusu/keratoconus-sick.jpeg",
          alt: "Хворий вигляд",
        },
        label: "хворий",
        icon: <ThumbsDown />,
      },
    ],
    body: (
      <>
        <h2 className="not-prose">Симптоми кератоконуса</h2>
        <ul>
          <li>
            Основний симптом — коливання зору. Пацієнт бачить то чітко, то не
            чітко
          </li>
          <li>
            Зниження гостроти зору, яке важко коригується окулярами та
            контактними лінзами
          </li>
          <li>Спотворення зображення</li>
          <li>Ореоли, засвіти особливо в вечірній та нічний час</li>
          <li>Швидка втомлюваність очей, зниження працездатності</li>
        </ul>
      </>
    ),
  },
  {
    type: PageBlock.info,
    reverse: true,
    img: {
      url: "/img/services/likuvannya-keratokonusu/crosslinking-method.jpeg",
      alt: "Методика крослінкінгу",
    },
    body: (
      <>
        <h2 className="not-prose">
          Методика крослінкінгу як високоефективне лікування кератоконуса
        </h2>
        <p>
          Офтальмологічний центр Дмитра Горячева пропонує сучасну методику
          лікування кератоконуса у Львові з використанням новітніх швидких
          протоколів, що дозволяють проводити крослінкінг навіть на очах з
          тонкою рогівкою.
        </p>
        <p>
          На сьогоднішній день у світі найбільш ефективним та безпечним методом
          вважається крослінкінг рогівки. Процедура крослінкінгу полягає у
          закрапуванні на рогівку ока розчину рибофлавіну (вітаміну B2) та
          короткочасному опроміненні ультрафіолетом за допомогою сучасного
          апарата останнього покоління Light Link. Цей пристрій дає можливість
          проводити процедуру, враховуючи індивідуальні потреби пацієнта. Він
          дозволяє оперувати навіть тонкі рогівки. Завдяки цьому зміцнюються
          зв’язки між колагеновими волокнами і формується каркас у стромі
          рогівки, що дозволяє зупинити прогресування кератоконусу та значно
          зменшити ймовірність ускладнень.
        </p>
        <p>
          Крослінкінг рогівки на сучасному обладнанні в Офтальмологічному центрі
          Дмитра Горячева — це безпечна малоінвазивна процедура. Вона дає
          тривалу стабілізацію зорових функцій і стану рогівки, а також має
          мінімальну кількість протипоказань і побічних ефектів.
        </p>
      </>
    ),
  },
  {
    type: PageBlock.info,
    reverse: true,
    img: {
      url: "/img/services/likuvannya-keratokonusu/crosslinking-pros.jpeg",
      alt: "Покази до крослінкінгу",
    },
    body: (
      <>
        <h2 className="not-prose">
          Які покази до крослінкінгу рогівкового колагену?
        </h2>
        <ul>
          <li>Кератоконус</li>
          <li>Пелюцідна краєва дегенерація</li>
          <li>Краєва дегенерація Терієна</li>
          <li>
            Ектазія після лазерної корекції зору (ЛАСІК, ФРК, радіальної
            кератомії)
          </li>
          <li>Дегенеративні захворювання рогівки</li>
          <li>Кератит — хронічне запальне інфекційне захворювання рогівки</li>
        </ul>
      </>
    ),
  },
  {
    type: PageBlock.info,
    img: {
      url: "/img/services/likuvannya-keratokonusu/crosslinking-cons.jpeg",
      alt: "Протипокази до крослінкінгу",
    },
    body: (
      <>
        <h2 className="not-prose">Які протипокази до крослінкінгу?</h2>
        <p>Абсолютні:</p>
        <ul>
          <li>Індивідуальна непереносимість рибофлавіну</li>
          <li>Активна фаза гепатиту A, B, C</li>
          <li>Гострі захворювання поверхні ока</li>
          <li>Перенесене герпетичне ураження ока</li>
        </ul>
        <p>Відносні:</p>
        <ul>
          <li>Супутні захворювання в активній стадії</li>
          <li>Щільні глибокі помутніння рогівки</li>
          <li>Виражений синдром сухого ока</li>
          <li>Сповільнення епітелізації рогівки</li>
        </ul>
      </>
    ),
  },
  {
    type: PageBlock.accordion,
    title: "Види крослінкінгу",
    stepsOut: true,
    carouselName: "Етапи операції",
    accordion: [
      {
        name: "Крослінкінг з фототерапевтичною кератектомією (ФТК)",
        desc: (
          <p>
            Крослінкінг із ФТК — комплексна методика лікування кератоконусу.
            Вона дозволяє покращити якість зору завдяки вирівнюванню поверхні
            ока лазерним променем. У ній використовується ексимерний лазер
            WaveLight EX500 (Alcon, США), який видаляє зовнішній шар оболонки
            ока — епітелій і, за необхідності, частину строми.
          </p>
        ),
        steps: [
          SurgeryStep.anastezia,
          SurgeryStep["open-eye"],
          SurgeryStep["epiteli-cut"],
          SurgeryStep.riboflavin,
          SurgeryStep["zailer-lamp"],
          SurgeryStep["protective-lense"],
          SurgeryStep["close-eye"],
        ],
      },
      {
        name: "Крослінкінг з деепітелізацією",
        desc: (
          <>
            <p>
              Найбільш ефективна методика лікування при 1–3 стадіях
              кератоконусу, коли товщина рогівки дозволяє здійснити хірургічне
              зняття епітелію рогівки для кращого проникнення дії ультрафіолету
              на глибші шари рогівки. Після закапування крапель рибофлавіну
              проводиться опромінення ультрафіолетом безпечного спектру.
            </p>
            <p>
              Рибофлавін виступає як фотосенсибілізатор, і, зв’язуючись з
              хвилями ультрафіолету, чинить зміцнюючий ефект на колагенові
              волокна рогівки. Завдяки цьому призупиняється прогресування
              стоншення рогівки. В кінці операції на око накладається мʼяка
              контактна лінза на 5-6 днів.
            </p>
          </>
        ),
        steps: [
          SurgeryStep.anastezia,
          SurgeryStep["open-eye"],
          SurgeryStep["eye-drops"],
          SurgeryStep.riboflavin,
          SurgeryStep["zailer-lamp"],
          SurgeryStep["protective-lense"],
          SurgeryStep["close-eye"],
        ],
      },
      {
        name: "Трансепітеліальний крослінкінг",
        desc: (
          <>
            <p>
              Проводиться при 2-3 стадіях кератоконусу, коли рогівка є тонкою, і
              немає можливості провести крослінкінг зі зняттям епітелію. Мета
              даної методики - зберегти верхній шар рогівки.
            </p>
            <p>
              Після закапування крапель рибофлавіну відбувається опромінення
              ультрафіолетом. Рибофлавін виступає як фотосенсибілізатор, і,
              зв’язуючись з хвилями ультрафіолету, чинить зміцнюючий ефект на
              колагенові волокна рогівки. Завдяки цьому призупиняється
              прогресування стоншення рогівки.
            </p>
          </>
        ),
        steps: [
          SurgeryStep.anastezia,
          SurgeryStep["open-eye"],
          SurgeryStep.riboflavin,
          SurgeryStep["zailer-lamp"],
          SurgeryStep["lens4sec-cure"],
          SurgeryStep["close-eye"],
        ],
      },
    ],
  },
  {
    type: PageBlock.instruction,
    title: "Рекомендації з підготовки до операції",
    options: [
      {
        text: "Пройти спеціалізовану діагностику.",
        icon: InstructionIcon["diagnostic"],
      },
      {
        text: "За 7 днів до операції відмовитись від використання контактних лінз.",
        icon: InstructionIcon["no-contacts"],
      },
      {
        text: "Не вживати алкоголь чи седативні препарати, які можуть викликати сонливість.",
        icon: InstructionIcon["no-pills-drink"],
      },
      {
        text: "Взяти з собою сонцезахисні окуляри.",
        icon: InstructionIcon["sunglasses"],
      },
      {
        text: "У день проведення процедури прийняти душ, не користуватись парфумами.",
        icon: InstructionIcon["no-perfume"],
      },
      {
        text: "Відмовитись від куріння в день проведення процедури.",
        icon: InstructionIcon["no-smoking"],
      },
      {
        text: "Прийняти всі ліки при супутніх захворюваннях.",
        icon: InstructionIcon["pills"],
      },
      {
        text: "Закрапати усі краплі, які ви звичайно закрапуєте.",
        icon: InstructionIcon["eye-drops"],
      },
      {
        text: "Протягом двох днів перед процедурою утриматись від застосування косметики.",
        icon: InstructionIcon["no-makeup"],
      },
      {
        text: "Прийти з супроводжуючою особою.",
        icon: InstructionIcon["help"],
      },
      {
        text: "Немає обмежень в прийомі їжі, воду споживайте як зазвичай.",
        icon: InstructionIcon["food"],
      },
    ],
  },
  {
    type: PageBlock.instruction,
    title: "Рекомендації з догляду після проведення процедури",
    options: [
      {
        text: "Протягом життя уникати потирання очей та сну обличчям у подушку.",
        icon: InstructionIcon["no-touch"],
      },
      {
        text: "Уникайте потрапляння води в очі під час прийому душу та ванни протягом 20 днів.",
        icon: InstructionIcon["shield"],
      },
      {
        text: "Контактна лінза  знімається у Медичному Центрі на 6 день після операціі.",
        icon: InstructionIcon["contacts"],
      },
      {
        text: "Не сідайте за кермо поки зір повністю не відновиться.",
        icon: InstructionIcon["no-drive"],
      },
      {
        text: "Протягом 1 року уникати впливу сонячних променів.",
        icon: InstructionIcon["sunglasses"],
      },
      {
        text: "Закрапувати краплі згідно схеми, наданої лікарем",
        icon: InstructionIcon["eye-drops"],
      },
      {
        text: "Не вживати алкоголь та не перебувати в задимлених приміщеннях протягом 1 місяця.",
        icon: InstructionIcon["no-alco-smoke"],
      },
      {
        text: "Не приймати системні ретиноїди",
        icon: InstructionIcon["no-pills"],
      },
      {
        text: "14 днів уникати фізичних навантажень, аеробіки, бігу.",
        icon: InstructionIcon["no-sports"],
      },
      {
        text: "Протягом одного місяця утриматись від відвідування басейну, лазні.",
        icon: InstructionIcon["no-swim"],
      },
    ],
  },
] as TypePageBlocks[];
