import {
  PageBlock,
  SurgeryStep,
  TypePageBlocks,
  InstructionIcon,
} from "../shared/PageBlocks/interfaces";

export default [
  {
    type: PageBlock.accordion,
    accordion: [
      {
        name: "Що таке синдром сухого ока?",
        desc: (
          <p>
            Хвороба/захворювання сухого ока&nbsp; — стан, що характеризується
            недостатньою кількістю сльози чи нестійкістю слізної плівки, тобто
            пришвидшеним висиханням сльози. Частим симптомом захворювання, як не
            парадоксально, є сльозотеча. Проявляється сухе око в кожної людини
            по іншому, з різною комбінацією скарг і їх інтенсивністю.
          </p>
        ),
      },
    ],
    carousel: [
      SurgeryStep["damaged-tear-film"],
      SurgeryStep["healthy-tear-film"],
    ],
  },
  {
    type: PageBlock.info,
    reverse: true,
    img: {
      url: "/img/services/likuvannya-sukhogo-oka/dry-eye-symptoms.jpeg",
      alt: "Симптоми хвороби сухого ока",
    },
    body: (
      <>
        <h2 className="not-prose">Симптоми хвороби сухого ока</h2>
        <ul>
          <li>Сухість, печіння</li>
          <li>
            Поколювання в очах, відчуття піску, стороннього тіла в очах, болючі
            чи ріжучі відчуття
          </li>
          <li>Подразнення, почервоніння очей</li>
          <li>
            Відчуття втоми, важкості в очах,&nbsp; важкості повік, особливо
            після зорового навантаження
          </li>
          <li>
            Нечіткість чи розмитість зору (що покращується після того як, людина
            покліпає)
          </li>
          <li>Виділення з очей, здебільшого білуватого кольору</li>
          <li>
            Неприємні відчуття, дискомфорт при носінні&nbsp; контактних лінз
          </li>
        </ul>
      </>
    ),
  },
  {
    type: PageBlock.info,
    img: {
      url: "/img/services/likuvannya-sukhogo-oka/dry-eye-reasons.jpeg",
      alt: "Причини виникнення сухості очей",
    },
    body: (
      <>
        <h2 className="not-prose">Причини виникнення сухості очей</h2>
        <p>
          Зазвичай, причиною є дисфункція мейбомієвих залоз, виділення з яких
          змащують та захищають очі, адже роблять нашу сльозу густішою. Коли
          виділень (секрету) цих залоз недостатньо, сльоза стає надто рідкою і
          нестійкою, швидко випаровується з поверхні ока. Такий стан часто
          виникає&nbsp; через низьку частоту кліпання, при тривалому зоровому
          навантаженні (робота з компʼютером, планшетом або смартфоном, водіння
          тощо).
        </p>
        <p>Сухість очей також виникає у наступних випадках:</p>
        <ul>
          <li>вроджені патології</li>
          <li>аутоімунні захворювання</li>
          <li>травми голови та очей</li>
          <li>термічні та хімічні опіки</li>
          <li>наслідки та ускладнення гострих інфекцій</li>
          <li>дефіцит вітаміну А</li>
          <li>
            після хірургічних втручань на очах, зокрема, лазерної корекції зору
          </li>
          <li>
            побічні ефекти деяких ліків,до прикладу - очних крапель з
            консервантами, системних чи місцевих ретиноїдів і інших
          </li>
          <li>тривале використання контактних лінз</li>
          <li>тривала робота у задимленому і кондиціонованому приміщенні</li>
        </ul>
      </>
    ),
  },
  {
    type: PageBlock.info,
    reverse: true,
    img: {
      url: "/img/services/likuvannya-sukhogo-oka/dry-eye-tests.jpeg",
      alt: "Діагностика захворювання",
    },
    body: (
      <>
        <h2 className="not-prose">
          Діагностика захворювання сухого ока в нашому центрі
        </h2>
        <p>
          Надмірна сухість ока може бути як самостійним захворюванням, так і
          симптомом іншої патології. Тому дуже важливо проводити комплексне
          обстеження, яке дозволяє виключити інші захворювання очного яблука (
          пошкодження кон'юнктиви, рогівки, сльозовивідних шляхів).
        </p>
        <p>
          Діагностика при сухості очей на апараті LacryDiag (Quantel Medical,
          Франція) передбачає вимірювання кількості та якості слізної рідини та
          оцінку швидкості її випаровування. Також проводиться мейбографія —
          обстеження мейбомієвих залоз. За необхідності лікар призначає
          додаткові аналізи і консультації суміжних спеціалістів, які дозволяють
          уточнити причину захворювання та вибрати оптимальний метод лікування.
        </p>
      </>
    ),
  },
  {
    type: PageBlock.accordion,
    carouselName: "Етапи процедури",
    accordion: [
      {
        name: "Як відбувається процедура?",
        desc: (
          <>
            <p>
              Лікування інтенсивним імпульсним світлом (Intense Pulsed Light)
              дозволяє зменшити запалення тканин навколо очей та «розтопити»
              густий секрет мейбомієвих залоз. Терапія методом IPL також чинить
              антибактеріальну дію та знищує мікроскопічних кліщів Demodex. Як
              бонус, ви отримуєте швидке омолодження клітин шкіри навколо очей.
            </p>
            <p>
              Процедура лікування синдрому сухого ока побудована наступним
              чином:
            </p>
            <ul>
              <li>
                спеціаліст клініки знімає макіяж і доглядові засоби, очищає
                шкіру
              </li>
              <li>очі захищаються спеціальними окулярами</li>
              <li>
                на шкіру наноситься&nbsp; гель для охолодження та покращення
                контакту
              </li>
              <li>
                спеціаліст робить пробний імпульс на шкірі подалі від очей
              </li>
              <li>
                при відсутності негативних реакцій зона навколо очей
                обробляється імпульсним світлом
              </li>
              <li>
                після завершення процедури проводиться легкий масаж, що очищає
                мейбомієві залози і стимулює сльозовиділення
              </li>
            </ul>
            <p>
              Процедура IPL-терапії проходить безболісно. Але під час апаратного
              лікування пацієнт може відчувати нагрівання, поколювання та легкий
              дискомфорт. Це нормальні явища, які проходять самі собою та не
              вимагають додаткового втручання спеціаліста. Перед початком
              процедури обов’язково відбувається перевірка на чутливість шкіри,
              яка допомагає уникнути серйозних побічних ефектів.
            </p>
          </>
        ),
      },
    ],
    carousel: [
      SurgeryStep["cleaning"],
      SurgeryStep["glasses-on"],
      SurgeryStep.sparks,
      SurgeryStep.gel,
      SurgeryStep["gel-off"],
    ],
  },
  {
    type: PageBlock.scrollCards,
    title: "Методи лікування сухого ока, які ми застосовуємо",
    cards: [
      {
        img: "/img/services/likuvannya-sukhogo-oka/cure-dry-eyes.jpeg",
        name: "Зволоження очей за допомогою безконсервантних крапель",
        desc: "Штучні сльози є симптоматичним лікуванням — зменшують і, можливо, зовсім усувають неприємні відчуття, а також, створюють захисну плівку на поверхні ока.\n\n Додатково можуть використовуватися ліки, які впливають на механізм розвитку сухого ока.",
      },
      {
        img: "/img/services/likuvannya-sukhogo-oka/blefastim.jpeg",
        name: "Процедура Блефастім і масаж повік",
        desc: "Блефастім зазвичай проводиться в комплексі з масажем повік. Це безболісна процедура, яка триває приблизно 20 хв. Під час процедури ми одягаємо пацієнту окуляри, які рівномірно прогрівають повіки протягом 10-15 хв. Після проводимо масаж повік (1-3 хв).\n\n Процедура проводиться для очищення і покращення роботи мейбомієвих залоз (залоз на повіках), покращує якість сльози і зменшує симптоми сухого ока.\n\n Покази - хвороба сухого ока, дисфункція мейбомієвих залоз, блефарит.",
      },
      {
        img: "/img/services/likuvannya-sukhogo-oka/ipl.jpeg",
        name: "IPL-терапія",
        desc: "Найсучасніший і найефективніший метод лікування хвороби сухого ока. Це швидка та безболісна процедура, яка передбачає стимуляцію залоз за допомогою світла. Вона має доведену ефективність та схвалена органами охорони здоров’я у більшості країн світу — в тому числі європейською агенцією EMA та американською FDA.",
      },
    ],
  },
  {
    type: PageBlock.instruction,
    title: "Рекомендації з підготовки до процедури IPL",
    options: [
      {
        text: "За 7 днів до процедури не засмагати та обмежити час перебування на сонці.",
        icon: InstructionIcon["no-sun"],
      },
      {
        text: "За тиждень припинити використання ексфоліантів, пілінгів та автозасмаги.",
        icon: InstructionIcon["no-sunscreen"],
      },
      {
        text: "Важливо: IPL не проводиться під час використання системних ретиноїдів.",
        icon: InstructionIcon["no-pills"],
      },
    ],
  },
  {
    type: PageBlock.instruction,
    title: "Рекомендації після IPL-терапії",
    options: [
      {
        text: "Обов’язково використовуйте засоби для зволоження шкіри та захисту від сонця (spf 30).",
        icon: InstructionIcon["sunscreen"],
      },
      {
        text: "Протягом тижня після процедури обмежте час перебування на сонці.",
        icon: InstructionIcon["no-glasses"],
      },
      {
        text: "Уникайте відвідування сауни, не приймайте гарячий душ чи ванну протягом декількох днів.",
        icon: InstructionIcon["no-basing"],
      },
      {
        text: "Можливий легкий дискомфорт, почервоніння шкіри, легкі виділення з очей, які з часом проходять.",
        icon: InstructionIcon.tears,
      },
    ],
  },
  {
    type: PageBlock.scrollCards,
    title: "Переваги лікування сухості очей у центрі Дмитра Горячева",
    cards: [
      {
        img: "/img/services/likuvannya-sukhogo-oka/upgrade.jpeg",
        name: "Постійне вдосконалення клініки",
        desc: "Ми інвестуємо в розвиток офтальмологічного центру та використовуємо сучасні методи лікування та діагностики при сухості ока.",
      },
      {
        img: "/img/services/likuvannya-sukhogo-oka/good-doctors.jpeg",
        name: "Висококваліфіковані лікарі",
        desc: "Співробітники клініки регулярно проходять додаткове навчання та освоюють вдосконалені методики лікування захворювань очей. Наші спеціалісти стежать за розвитком медицини та призначають найкращі засоби догляду за очима — найефективніші та найбезпечніші. Наш колектив — це команда відданих своїй справі спеціалістів, які ставляться до пацієнтів з турботою та повагою.",
      },
      {
        img: "/img/services/likuvannya-sukhogo-oka/modern-machines.jpeg",
        name: "Сучасне обладнання",
        desc: "Ми використовуємо новітню техніку, яка робить лікування за допомогою апарату IPL швидким і мінімізує рівень дискомфорту. Застосування якісних препаратів знижує ймовірність побічних ефектів і зменшує тривалість реабілітації.",
      },
    ],
  },
] as TypePageBlocks[];
