// import { Instruction, InstructionIcon } from "../../interfaces";

// export const INSTRUCTIONS: Record<
//   Instruction,
//   { text: string; icon: InstructionIcon }
// > = {
//   [Instruction["undergo-spec-diagnostics"]]: {
//     icon: InstructionIcon["no-touch"],
//     text: "Уникайте потирання очей та сну обличчям в подушку протягом двох тижнів після лазерної корекції.",
//   },
//   []: {
//     icon:InstructionIcon["no-makeup"],
// text:"Протягом 20 днів після операції не наносьте макіяж повік, вій. Уникайте використання косметики навколо очей."
//   }
//   //   ,
//   // [Instruction["tears"]]:
//   //   "Протягом певного періоду після операції можлива різна ступінь дискомфорту, сльозотеча. Цей час рекомендовано проводити із закритими очима.",
//   // [Instruction["contacts"]]:
//   //   "Одразу після лазерної корекції вам нанесуть захисну контактну лінзу, яку лікар зніме на 5-6 день після операції у клініці.",
//   // [Instruction["doc"]]:
//   //   "Дотримуйтесь рекомендацій лікаря стосовно використання засобів особистої гігієни, засобів для догляду за волоссям.",
//   // [Instruction["shield"]]:
//   //   "Уникайте потрапляння води в очі під час прийому душу та ванни протягом 20 днів.",
//   // [Instruction["no-dust"]]:
//   //   "Перші 14 днів після лазерної корекції уникайте накурених, задимлених, запилючених приміщень.",
//   // [Instruction["eye-drops"]]:
//   //   "Дотримуйтесь схеми застосування післяопераційних крапель та медикаментів.",
//   // [Instruction["sunglasses"]]:
//   //   "Протягом року після операції у сонячну погоду одягайте сонцезахисні окуляри при операції методом StreamLight і PRK.",
//   // [Instruction["pc"]]:
//   //   "Через 5 днів після лазерної корекції можна працювати за компʼютером.",
//   // [Instruction["no-swim"]]: "Не відвідуйте басейн та сауну 21 день.",
//   // [Instruction["no-sports"]]:
//   //   "Уникайте підйому важких речей та активного спорту впродовж 14 днів після лазерної корекції.",
//   // [Instruction["no-drive"]]:
//   //   "Не сідайте за кермо поки зір повністю не відновиться.",
//   // [Instruction.diagnostic]: "Пройти спеціалізовану діагностику.",
//   // [Instruction["no-contacts"]]:
//   //   "За 7 днів до операції відмовитись від використання контактних лінз.",
//   // [Instruction["no-pills-drink"]]:
//   //   "Не вживати алкоголь чи седативні препарати, які можуть викликати сонливість.",
//   // [Instruction["no-perfume"]]:
//   //   "У день проведення процедури прийняти душ, не користуватись парфумами.",
//   // [Instruction["no-smoking"]]:
//   //   "Відмовитись від куріння в день проведення процедури.",
//   // [Instruction["pills"]]: "Прийняти всі ліки при супутніх захворюваннях.",
//   // [Instruction["help"]]: "Прийти з супроводжуючою особою.",
//   // [Instruction["food"]]:
//   //   "Немає обмежень в прийомі їжі, воду споживайте як зазвичай.",
// };
