import { Metadata } from "next";

import InfoBlock from "@/components/shared/InfoBlock";
import TopBanner from "@/components/shared/TopBanner";
import { DoctorsGrid } from "@/components/likari-page";

import { genMetaData } from "@/lib/metadata";

export const metadata: Metadata = genMetaData({
  title: "Офтальмологи в Ужгороді | Лікарі Центру Горячева",
  description:
    "Команда офтальмологів та офтальмохірургів Центру Дмитра Горячева в Ужгороді. Спеціалізації лікарів, досвід та запис на консультацію.",
  img: "img/likari/likari-og.jpg",
  canonical: "likari",
});

export default function DoctorsPage() {
  return (
    <>
      <TopBanner
        title="Офтальмологи в Ужгороді - команда Центру Дмитра Горячева"
        desc="Досвід, якому варто довіритись"
        img={{ url: "/img/likari/baner.jpg", alt: "Лікарі" }}
      />
      <DoctorsGrid title="Наша команда" />
      <InfoBlock sectionClassName="pt-0">
        <p>
          Здоров’я ваших очей - у руках досвідчених фахівців. В Офталіф
          муіьмологічному центрі Дмитра Горячева в Ужгороді працює команда
          лікарів, яка спеціалізується на діагностиці, профілактиці та лікуванні
          захворювань органів зору.
        </p>
        <p>
          Наші офтальмологи застосовують сучасні методи діагностики та
          лікування, керуються принципами доказової медицини й постійно
          вдосконалюють професійні знання та практичні навички.
        </p>
        <p>
          Ми переконані, що якісна офтальмологічна допомога починається з довіри
          між лікарем і пацієнтом. Саме тому приділяємо особливу увагу
          індивідуальному підходу, ретельній діагностиці та зрозумілому
          поясненню кожного етапу обстеження й лікування.
        </p>
        <p>
          <b>Познайомтеся з нашими лікарями</b> - фахівцями, які щодня працюють
          заради збереження та покращення вашого зору.
        </p>
      </InfoBlock>
    </>
  );
}
