import { FC } from "react";

import InfoBlock from "@/components/shared/InfoBlock";

const WhyWe: FC = () => (
  <InfoBlock
    img={{
      url: "/img/home/operating.jpeg",
      alt: "Operating",
    }}
  >
    <h2 className="not-prose">Про центр</h2>
    <p>
      Офтальмологічний центр Дмитра Горячева - це мережа офтальмологічних клінік
      які є передовими в області. Все, що заважає вам бачити чітко та ясно - ми
      вирішимо в найкоротші терміни, безболісно та якісно. Ми постійно
      вдосконалюємося, щоб ви могли отримати широкий спектр послуг найбільш
      якісно та за прийнятними цінами.
    </p>
    <p>
      В нашій команді - найдосвідченіші фахівці із різною спеціалізацією. Очолює
      клініку - Дмитро Горячев, кандидат медичних наук, лікар вищої категорії,
      лікар-офтальмолог, офтальмохірург, має 13 років професійного досвіду,
      провів десятки тисяч операцій на очах. Також вам допоможуть наші фахові
      лікарі-офтальмологи, офтальмохірурги, дитячі офтальмологи, ексімерлазерні
      хірурги, спеціалісти з ортокератології, мультидіагности, окулопластичні
      хірурги та фахівці з б’юті медицини.
    </p>
    <p>Ми пропонуємо велику кількість офтальмологічних процедур.</p>
    <h3>Клініка та послуги постійно удосконалюються</h3>
    <p>
      Звертаючись до офтальмолога у медичний центр Дмитра Горячева, ви можете
      розраховувати на винятковий професіоналізм і застосування сучасних методик
      лікування. Ми постійно інвестуємо як у покращення обладнання, так і в
      навчання персоналу центра. Безперервне підвищення кваліфікації та освоєння
      нової техніки гарантують високу якість послуг для кожного пацієнта.&nbsp;
    </p>
  </InfoBlock>
);

export default WhyWe;
