import { FC } from "react";

import InfoBlock from "@/components/shared/InfoBlock";

const WhyWe: FC = () => (
  <InfoBlock
    img={{
      url: "/img/home/operating.jpeg",
      alt: "Operating",
    }}
  >
    <h2 className="not-prose">
      Чому варто обрати офтальмологічний центр Дмитра Горячева у Львові?
    </h2>
    <p>
      Наші лікарі-офтальмологи надають кваліфіковану медичну допомогу при
      виникненні проблем із зором. Ми пропонуємо широкий спектр послуг,
      використовуючи перевірені методики з доведеною ефективністю, що пройшли
      багатоступеневі випробування та клінічні іспити.&nbsp;
    </p>
    <h3>Клініка та послуги постійно удосконалюються</h3>
    <p>
      Звертаючись до офтальмолога у медичний центр Дмитра Горячева, ви можете
      розраховувати на винятковий професіоналізм і застосування сучасних методик
      лікування. Ми постійно інвестуємо як у покращення обладнання, так і в
      навчання персоналу центра. Безперервне підвищення кваліфікації та освоєння
      нової техніки гарантують високу якість послуг для кожного пацієнта.&nbsp;
    </p>
  </InfoBlock>
);

export default WhyWe;
